#include "ultra64.h"
#include "global.h"

typedef struct {
    u8 len;
    u8 notesIdx[8];
} OcarinaSongInfo;

typedef struct {
    /* 0x0000 */ u8 noteIdx;
    /* 0x0001 */ u8 unk_01;
    /* 0x0002 */ u16 unk_02;
    /* 0x0004 */ u8 unk_04;
    /* 0x0005 */ u8 unk_05;
    /* 0x0006 */ s8 unk_06;
    /* 0x0007 */ u8 unk_07;
} OcarinaNote;  // size = 0x8

typedef struct {
    /* 0x0000 */ OcarinaNote notes[20];
} OcarinaSong; // size = 0xA0

typedef struct {
    u8 unk_00;
    u8 unk_01;
    u8 unk_02;
} unk_s5;

typedef struct {
    f32 unk_00;
    f32 unk_04;
    u8 unk_08;
    u8 unk_09;
    u8 unk_0A;
    u8 unk_0B;
    u8 unk_0C;
} unk_s1;

typedef struct {
    f32 unk_00;
    f32 unk_04;
    f32 unk_08;
    s32 unk_0C;
} unk_s2;

void func_800FA240(u8, u8, u8, u8);
void func_800F5550(u16);
void func_800F5E18(u8 arg0, u16 arg1, u8 arg2, s8 arg3, s8 arg4);
void func_800F4784(unk_s2 *arg0);
void func_800F56A8(void);
void func_800F6FB4(u8);

// stick float vals
extern f32 D_8012F6B4[];
extern s32 sOcarinaAllowedBtnMask; // 80130EFC 
extern s32 sOcarinaABtnMap; // 80130F00
extern s32 sOcarinaCUPBtnMap; // 80130F04
extern s32 sOcarinaCDownBtnMap; // 80130F08
extern u8 D_80131F64;
extern u8 D_80133408;
extern s8 D_8013060C;
extern u8 D_80130604;
extern s8 D_80130614;
extern f32 D_80130620;
extern s8 D_80130624;
extern u8 D_80131878;
