#include <ultra64.h>
#include <global.h>

#define SFX_BANK_ID(sfxId) ((sfxId >> 0xC) & 0xFF)
#define SFX_ID(sfxId) (sfxId & 0x1FF) // consider rename to SFX_INDEX or similar

#define SFX_BANK_ID_2(sfxId) (sfxId & 0xF000)
#define SFX_BANK_ID_3(sfxId) SFX_BANK_ID(SFX_BANK_ID_2(sfxId))

typedef struct {
    /* 0x00 */ u16     sfxId;
    /* 0x04 */ Vec3f*  unk_4;
    /* 0x08 */ u8      unk_8;
    /* 0x0C */ u32*    unk_C;
    /* 0x10 */ u32*    unk_10;
    /* 0x14 */ u32*    unk_14;
} Struct_800F738C; // size = 0x18

typedef struct {
    /* 0x00 */ Vec3f*   pos;        // "pos"
    /* 0x04 */ f32*     unk_4;
    /* 0x08 */ f32*     unk_8;
    /* 0x0C */ u8       unk_C;
    /* 0x10 */ u32*     unk_10;
    /* 0x14 */ u32*     unk_14;
    /* 0x18 */ u32*     unk_18;
    /* 0x1C */ f32      unk_1C;
    /* 0x20 */ u32      unk_20;
    /* 0x24 */ u8       unk_24; 
    /* 0x26 */ u16      unk_26;
    /* 0x28 */ u16      unk_28;     // "flag"
    /* 0x2A */ u8       unk_2A;
    /* 0x2B */ u8       unk_2B;
    /* 0x2C */ u8       prev;       // prev bank index
    /* 0x2D */ u8       next;       // next bank index
    /* 0x2E */ u8       unk_2E;
    /* 0x2F */ u8       unk_2F;
} Struct_800F74E0; // size = 0x30

typedef struct {
    /* 0x00 */ f32 unk_0;
    /* 0x04 */ f32 unk_4;
    /* 0x08 */ f32 unk_8;
    /* 0x0C */ u16 unk_C;
} Struct_800F8EA0; // size = 0x10

typedef struct {
    u32 unk_0;
    u8 unk_4;
} Struct_800F7CEC;

typedef struct {
    u8  unk_0;
    u16 unk_2;
} Struct_8013331C;



extern u8 D_80130570[];

extern u8 D_80130578[4][7];

extern u8 D_80130594[4][7];

extern Struct_800F74E0 D_8016BAD0[];
extern Struct_800F74E0 D_8016BC80[];
extern Struct_800F74E0 D_8016BEC0[];
extern Struct_800F74E0 D_8016C2E0[];
extern Struct_800F74E0 D_8016C6A0[];
extern Struct_800F74E0 D_8016C820[];
extern Struct_800F74E0 D_8016C8B0[];

u8 D_80133340[4] = {
    0x53, 0x45, 0x00, 0x00,
};
                    //VT_COL(RED,WHITE)                                                         VT_RST
char D_80133344[] = "\x1B[41;37m" "<INAGAKI CHECK> dist over! flag:%04X ptr:%08X pos:%f-%f-%f" "\x1B[m" "\n";

s32 D_8013338C = 0;

UNK_TYPE D_80133390[] = {
    0x53455120, 0x48000000,
};

UNK_TYPE D_80133398[] = {
    0x20202020, 0x4C000000,
};

u8 D_801333A0 = 0;

u8 D_801333A4 = 0;

/**
