#include <ultra64.h>
#include <global.h>

typedef enum {
    /* 0x00 */ DROP_RUPEE_GREEN,
    /* 0x01 */ DROP_RUPEE_BLUE,
    /* 0x02 */ DROP_RUPEE_RED,
    /* 0x03 */ DROP_HEART,
    /* 0x04 */ DROP_BOMBS_A,
    /* 0x05 */ DROP_ARROWS_SINGLE,
    /* 0x06 */ DROP_HEART_PIECE,
    /* 0x07 */ DROP_HEART_CONTAINER,
    /* 0x08 */ DROP_ARROWS_SMALL,
    /* 0x09 */ DROP_ARROWS_MEDIUM,
    /* 0x0A */ DROP_ARROWS_LARGE,
    /* 0x0B */ DROP_BOMBS_B,
    /* 0x0C */ DROP_NUTS,
    /* 0x0D */ DROP_STICK,
    /* 0x0E */ DROP_MAGIC_LARGE,
    /* 0x0F */ DROP_MAGIC_SMALL,
    /* 0x10 */ DROP_SEEDS,
    /* 0x11 */ DROP_SMALL_KEY,
    /* 0x12 */ DROP_FLEXIBLE,
    /* 0x13 */ DROP_RUPEE_ORANGE,
    /* 0x14 */ DROP_RUPEE_PURPLE,
    /* 0x15 */ DROP_SHIELD_DEKU,
    /* 0x16 */ DROP_SHIELD_HYLIAN,
    /* 0x17 */ DROP_TUNIC_ZORA,
    /* 0x18 */ DROP_TUNIC_GORON,
    /* 0x19 */ DROP_BOMBS_SPECIAL
} DropType;

typedef struct {
    /* 0x000 */ Actor actor;
    /* 0x14C */ ActorFunc updateFunc;
    /* 0x150 */ s16 collectibleFlag;
    /* 0x152 */ s16 unk_152;
    /* 0x154 */ s16 unk_154;
    /* 0x156 */ s16 unk_156;
    /* 0x158 */ s16 unk_158;
    /* 0x15A */ s16 unk_15A;
    /* 0x15C */ f32 unk_15C;
    /* 0x160 */ ColliderCylinderMain cylinderCollider;
} ActorEnItem00;

void func_8001DFC8(ActorEnItem00* this, GlobalContext* globalCtx);
void func_8001E1C8(ActorEnItem00* this, GlobalContext* globalCtx);
void func_8001E304(ActorEnItem00* this, GlobalContext* globalCtx);
void func_8001E5C8(ActorEnItem00* this, GlobalContext* globalCtx);

// TODO: Define this part of code .data here and rename the symbols
extern ActorInit En_Item00_InitVars;
extern ColliderCylinderInit D_801154E0;
extern InitChainEntry D_8011550C[];
extern Color_RGB8 D_80115510;
extern Color_RGB8 D_80115514;
extern UNK_TYPE D_80115518;
extern UNK_TYPE D_80115524;
extern u32 D_80115530[];
extern u32 D_80115544[];
extern u8 D_80115574[];
extern u8 D_80115664[];

// Internal Actor Functions

void En_Item00_SetNewUpdate(ActorEnItem00* this, ActorFunc newUpdateFunc) {
    this->updateFunc = newUpdateFunc;
}

#ifdef NON_MATCHING
// Very close to matching, just a single ordering issue
