/*
 * File: z_en_hy.c
 * Overlay: ovl_En_Hy
 * Description: Hylian NPCs
 */

#include "z_en_hy.h"
#include "versions.h"
#include "assets/objects/object_aob/object_aob.h"
#include "assets/objects/object_ahg/object_ahg.h"
#include "assets/objects/object_bob/object_bob.h"
#include "assets/objects/object_boj/object_boj.h"
#include "assets/objects/object_bba/object_bba.h"
#include "assets/objects/object_bji/object_bji.h"
#include "assets/objects/object_cne/object_cne.h"
#include "assets/objects/object_cob/object_cob.h"
#include "assets/objects/object_os_anime/object_os_anime.h"

#define FLAGS (ACTOR_FLAG_ATTENTION_ENABLED | ACTOR_FLAG_FRIENDLY | ACTOR_FLAG_UPDATE_CULLING_DISABLED)

void EnHy_Init(Actor* thisx, PlayState* play);
void EnHy_Destroy(Actor* thisx, PlayState* play);
void EnHy_Update(Actor* thisx, PlayState* play);
void EnHy_Draw(Actor* thisx, PlayState* play);

void EnHy_WaitForObjects(EnHy* this, PlayState* play);
void EnHy_Pace(EnHy* this, PlayState* play);
void EnHy_FinishGivingDogFoundReward(EnHy* this, PlayState* play);
void EnHy_Walk(EnHy* this, PlayState* play);
void EnHy_SetupPace(EnHy* this, PlayState* play);
void EnHy_WatchDog(EnHy* this, PlayState* play);
void EnHy_Fidget(EnHy* this, PlayState* play);
void EnHy_DoNothing(EnHy* this, PlayState* play);
void EnHy_WaitDogFoundRewardGiven(EnHy* this, PlayState* play);

ActorProfile En_Hy_Profile = {
    /**/ ACTOR_EN_HY,
    /**/ ACTORCAT_NPC,
    /**/ FLAGS,
    /**/ OBJECT_GAMEPLAY_KEEP,
    /**/ sizeof(EnHy),
    /**/ EnHy_Init,
    /**/ EnHy_Destroy,
    /**/ EnHy_Update,
    /**/ EnHy_Draw,
};

static ColliderCylinderInit sColCylInit = {
    {
        COL_MATERIAL_NONE,
        AT_NONE,
        AC_NONE,
        OC1_ON | OC1_TYPE_ALL,
        OC2_TYPE_2,
        COLSHAPE_CYLINDER,
    },
    {
        ELEM_MATERIAL_UNK0,
        { 0x00000000, 0x00, 0x00 },
        { 0x00000000, 0x00, 0x00 },
        ATELEM_NONE,
        ACELEM_NONE,
        OCELEM_ON,
    },
    { 20, 46, 0, { 0, 0, 0 } },
};

static CollisionCheckInfoInit2 sColChkInfoInit = { 0, 0, 0, 0, MASS_IMMOVABLE };

// NULL-terminated arrays of eye textures
static void* sHylianWoman1EyeTextures[] = {
    gHylianWoman1EyeOpenTex,
    gHylianWoman1EyeHalfTex,
    gHylianWoman1EyeClosedTex,
    NULL,
};
static void* sHylianMan1EyeTextures[] = {
    gHylianMan1BeardedEyeOpenTex,
    gHylianMan1BeardedEyeHalfTex,
    gHylianMan1BeardedEyeClosedTex,
    NULL,
};
static void* sHylainOldWomanEyeTextures[] = {
    gHylianOldWomanEyeTex,
    NULL,
};
static void* sHylianOldManEyeTextures[] = {
    gHylianOldManEyeOpenTex,
    gHylianOldManEyeHalfTex,
    gHylianOldManEyeClosedTex,
    NULL,
};
static void* sHylianMan2EyeTextures[] = {
    gHylianMan2MustachedEyeOpenTex,
    gHylianMan2MustachedEyeHalfTex,
    gHylianMan2MustachedEyeClosedTex,
    NULL,
};
static void* sHylianWoman2EyeTextures[] = {
    gHylianWoman2EyeOpenTex,
    gHylianWoman2EyeHalfTex,
    gHylianWoman2EyeClosedTex,
    NULL,
};

typedef struct EnHyHeadInfo {
    /* 0x0 */ s16 objectId;
    /* 0x4 */ Gfx* headDList;
    /* 0x8 */ void** eyeTextures;
} EnHyHeadInfo; // size = 0xC

typedef enum {
    /*  0 */ ENHY_HEAD_WOMAN_1,
    /*  1 */ ENHY_HEAD_WOMAN_2,
    /*  2 */ ENHY_HEAD_MAN_2_MUSTACHE,
    /*  3 */ ENHY_HEAD_MAN_2_BALD,
    /*  4 */ ENHY_HEAD_MAN_2_LONG_HAIR,
    /*  5 */ ENHY_HEAD_MAN_2_ALT_MUSTACHE,
    /*  6 */ ENHY_HEAD_MAN_2_BEARD,
    /*  7 */ ENHY_HEAD_MAN_1_BEARD,
    /*  8 */ ENHY_HEAD_MAN_1_SHAVED,
    /*  9 */ ENHY_HEAD_MAN_1_BOWL_CUT,
    /* 10 */ ENHY_HEAD_OLD_WOMAN,
    /* 11 */ ENHY_HEAD_YOUNG_WOMAN_BROWN_HAIR,
    /* 12 */ ENHY_HEAD_YOUNG_WOMAN_ORANGE_HAIR,
    /* 13 */ ENHY_HEAD_OLD_MAN,
    /* 14 */ ENHY_HEAD_OLD_MAN_BALD,
    /* 15 */ ENHY_HEAD_WOMAN_3
} EnHyHeadIndex;

static EnHyHeadInfo sHeadInfo[] = {
    /* ENHY_HEAD_WOMAN_1 */ { OBJECT_AOB, gHylianWoman1HeadDL, sHylianWoman1EyeTextures },
    /* ENHY_HEAD_WOMAN_2 */ { OBJECT_BOB, gHylianWoman2HeadDL, sHylianWoman2EyeTextures },
    /* ENHY_HEAD_MAN_2_MUSTACHE */ { OBJECT_BOJ, gHylianMan2MustachedHeadDL, sHylianMan2EyeTextures },
    /* ENHY_HEAD_MAN_2_BALD */ { OBJECT_BOJ, gHylianMan2BaldHeadDL, NULL },
    /* ENHY_HEAD_MAN_2_LONG_HAIR */ { OBJECT_BOJ, gHylianMan2LongHairHeadDL, NULL },
    /* ENHY_HEAD_MAN_2_ALT_MUSTACHE */ { OBJECT_BOJ, gHylianMan2AltMustachedHeadDL, NULL },
    /* ENHY_HEAD_MAN_2_BEARD */ { OBJECT_BOJ, gHylianMan2BeardedHeadDL, NULL },
    /* ENHY_HEAD_MAN_1_BEARD */ { OBJECT_AHG, gHylianMan1BeardedHeadDL, sHylianMan1EyeTextures },
    /* ENHY_HEAD_MAN_1_SHAVED */ { OBJECT_AHG, gHylianMan1ShavedHeadDL, NULL },
    /* ENHY_HEAD_MAN_1_BOWL_CUT */ { OBJECT_AHG, gHylianMan1BowlCutHeadDL, NULL },
    /* ENHY_HEAD_OLD_WOMAN */ { OBJECT_BBA, gHylianOldWomanHeadDL, sHylainOldWomanEyeTextures },
    /* ENHY_HEAD_YOUNG_WOMAN_BROWN_HAIR */ { OBJECT_CNE, gHylianYoungWomanBrownHairHeadDL, NULL },
    /* ENHY_HEAD_YOUNG_WOMAN_ORANGE_HAIR */ { OBJECT_CNE, gHylianYoungWomanOrangeHairHeadDL, NULL },
    /* ENHY_HEAD_OLD_MAN */ { OBJECT_BJI, gHylianOldManHeadDL, sHylianOldManEyeTextures },
    /* ENHY_HEAD_OLD_MAN_BALD */ { OBJECT_BJI, gHylianOldManBaldHeadDL, NULL },
    /* ENHY_HEAD_WOMAN_3 */ { OBJECT_COB, gHylianWoman3HeadDL, NULL },
};

typedef struct EnHySkeletonInfo {
    /* 0x0 */ s16 objectId;
    /* 0x4 */ FlexSkeletonHeader* skeleton;
} EnHySkeletonInfo; // size = 0x8

typedef enum {
    /* 0 */ ENHY_SKEL_WOMAN_1,
    /* 1 */ ENHY_SKEL_WOMAN_2,
    /* 2 */ ENHY_SKEL_MAN_2,
    /* 3 */ ENHY_SKEL_MAN_1,
    /* 4 */ ENHY_SKEL_OLD_WOMAN,
    /* 5 */ ENHY_SKEL_YOUNG_WOMAN,
    /* 6 */ ENHY_SKEL_OLD_MAN,
    /* 7 */ ENHY_SKEL_WOMAN_3
} EnHySkeletonIndex;

static EnHySkeletonInfo sSkeletonInfo[] = {
    /* ENHY_SKEL_WOMAN_1 */ { OBJECT_AOB, &gHylianWoman1Skel },
    /* ENHY_SKEL_WOMAN_2 */ { OBJECT_BOB, &gHylianWoman2Skel },
    /* ENHY_SKEL_MAN_2 */ { OBJECT_BOJ, &gHylianMan2Skel },
    /* ENHY_SKEL_MAN_1 */ { OBJECT_AHG, &gHylianMan1Skel },
    /* ENHY_SKEL_OLD_WOMAN */ { OBJECT_BBA, &gHylianOldWomanSkel },
    /* ENHY_SKEL_YOUNG_WOMAN */ { OBJECT_CNE, &gHylianYoungWomanSkel },
    /* ENHY_SKEL_OLD_MAN */ { OBJECT_BJI, &gHylianOldManSkel },
    /* ENHY_SKEL_WOMAN_3 */ { OBJECT_COB, &gHylianWoman3Skel },
};

typedef enum EnHyAnimationIndex {
    /*  0 */ ENHY_ANIM_0,
    /*  1 */ ENHY_ANIM_1,
    /*  2 */ ENHY_ANIM_2,
    /*  3 */ ENHY_ANIM_3,
    /*  4 */ ENHY_ANIM_4,
    /*  5 */ ENHY_ANIM_5,
    /*  6 */ ENHY_ANIM_6,
    /*  7 */ ENHY_ANIM_7,
    /*  8 */ ENHY_ANIM_8,
    /*  9 */ ENHY_ANIM_9,
    /* 10 */ ENHY_ANIM_10,
    /* 11 */ ENHY_ANIM_11,
    /* 12 */ ENHY_ANIM_12,
    /* 13 */ ENHY_ANIM_13,
    /* 14 */ ENHY_ANIM_14,
    /* 15 */ ENHY_ANIM_15,
    /* 16 */ ENHY_ANIM_16,
    /* 17 */ ENHY_ANIM_17,
    /* 18 */ ENHY_ANIM_18,
    /* 19 */ ENHY_ANIM_19,
    /* 20 */ ENHY_ANIM_20,
    /* 21 */ ENHY_ANIM_21,
    /* 22 */ ENHY_ANIM_22,
    /* 23 */ ENHY_ANIM_23,
    /* 24 */ ENHY_ANIM_24,
    /* 25 */ ENHY_ANIM_25,
    /* 26 */ ENHY_ANIM_26
} EnHyAnimationIndex;

static AnimationInfo sAnimationInfo[] = {
    /* ENHY_ANIM_0 */ { &gObjOsAnim_092C, 1.0f, 0.0f, -1.0f, ANIMMODE_LOOP, 0.0f },
    /* ENHY_ANIM_1 */ { &gObjOsAnim_0228, 1.0f, 0.0f, -1.0f, ANIMMODE_LOOP, 0.0f },
    /* ENHY_ANIM_2 */ { &gObjOsAnim_4CF4, 1.0f, 0.0f, -1.0f, ANIMMODE_LOOP, 0.0f },
    /* ENHY_ANIM_3 */ { &gObjOsAnim_16EC, 1.0f, 0.0f, -1.0f, ANIMMODE_LOOP, 0.0f },
    /* ENHY_ANIM_4 */ { &gObjOsAnim_265C, 1.0f, 0.0f, -1.0f, ANIMMODE_LOOP, 0.0f },
    /* ENHY_ANIM_5 */ { &gObjOsAnim_42AC, 1.0f, 0.0f, -1.0f, ANIMMODE_LOOP, 0.0f },
    /* ENHY_ANIM_6 */ { &gObjOsAnim_28DC, 1.0f, 0.0f, -1.0f, ANIMMODE_LOOP, 0.0f },
    /* ENHY_ANIM_7 */ { &gObjOsAnim_2160, 1.0f, 0.0f, -1.0f, ANIMMODE_LOOP, -10.0f },
    /* ENHY_ANIM_8 */ { &gObjOsAnim_265C, 1.0f, 0.0f, -1.0f, ANIMMODE_LOOP, -10.0f },
    /* ENHY_ANIM_9 */ { &gObjOsAnim_4E90, 1.0f, 0.0f, -1.0f, ANIMMODE_LOOP, 0.0f },
    /* ENHY_ANIM_10 */ { &gObjOsAnim_1E7C, 1.0f, 0.0f, -1.0f, ANIMMODE_LOOP, 0.0f },
    /* ENHY_ANIM_11 */ { &gObjOsAnim_0170, 1.0f, 0.0f, -1.0f, ANIMMODE_LOOP, 0.0f },
    /* ENHY_ANIM_12 */ { &gObjOsAnim_00B4, 1.0f, 0.0f, -1.0f, ANIMMODE_LOOP, 0.0f },
    /* ENHY_ANIM_13 */ { &gObjOsAnim_3D84, 1.0f, 0.0f, -1.0f, ANIMMODE_LOOP, 0.0f },
    /* ENHY_ANIM_14 */ { &gObjOsAnim_41F8, 1.0f, 0.0f, -1.0f, ANIMMODE_LOOP, 0.0f },
    /* ENHY_ANIM_15 */ { &gObjOsAnim_300C, 1.0f, 0.0f, -1.0f, ANIMMODE_LOOP, 0.0f },
    /* ENHY_ANIM_16 */ { &gObjOsAnim_31B0, 1.0f, 0.0f, -1.0f, ANIMMODE_LOOP, 0.0f },
    /* ENHY_ANIM_17 */ { &gObjOsAnim_31B0, 1.0f, 0.0f, -1.0f, ANIMMODE_LOOP, -8.0f },
    /* ENHY_ANIM_18 */ { &gObjOsAnim_2D0C, 1.0f, 0.0f, -1.0f, ANIMMODE_LOOP, 0.0f },
    /* ENHY_ANIM_19 */ { &gObjOsAnim_2DC0, 1.0f, 0.0f, -1.0f, ANIMMODE_LOOP, 0.0f },
    /* ENHY_ANIM_20 */ { &gObjOsAnim_4408, 1.0f, 0.0f, -1.0f, ANIMMODE_LOOP, 0.0f },
    /* ENHY_ANIM_21 */ { &gObjOsAnim_1F18, 1.0f, 0.0f, -1.0f, ANIMMODE_LOOP, 0.0f },
    /* ENHY_ANIM_22 */ { &gObjOsAnim_4F28, 1.0f, 0.0f, -1.0f, ANIMMODE_LOOP, 0.0f },
    /* ENHY_ANIM_23 */ { &gObjOsAnim_33B4, 1.0f, 0.0f, -1.0f, ANIMMODE_LOOP, -8.0f },
    /* ENHY_ANIM_24 */ { &gObjOsAnim_12E8, 1.0f, 0.0f, -1.0f, ANIMMODE_LOOP, -8.0f },
    /* ENHY_ANIM_25 */ { &gObjOsAnim_0FE4, 1.0f, 0.0f, -1.0f, ANIMMODE_LOOP, -8.0f },
    /* ENHY_ANIM_26 */ { &gObjOsAnim_0BFC, 1.0f, 0.0f, -1.0f, ANIMMODE_LOOP, -8.0f },
};

typedef struct EnHyModelInfo {
    /* 0x0 */ u8 headInfoIndex;      // EnHyHeadIndex
    /* 0x1 */ u8 upperSkelInfoIndex; // EnHySkeletonIndex, see EnHy.objectSlotUpperSkel
    /* 0x2 */ Color_RGBA8 envColorSeg8;
    /* 0x6 */ u8 lowerSkelInfoIndex; // EnHySkeletonIndex, see EnHy.objectSlotLowerSkel
    /* 0x7 */ Color_RGBA8 envColorSeg9;
    /* 0xB */ u8 animInfoIndex; // EnHyAnimationIndex
} EnHyModelInfo;                // size = 0xC

static EnHyModelInfo sModelInfo[] = {
    /* ENHY_TYPE_DOG_LADY */
    {
        ENHY_HEAD_WOMAN_1,
        ENHY_SKEL_WOMAN_1,
        { 255, 255, 255, 255 },
        ENHY_SKEL_WOMAN_1,
        { 255, 255, 255, 255 },
        ENHY_ANIM_0,
    },
    /* ENHY_TYPE_WOMAN_3 */
    {
        ENHY_HEAD_WOMAN_3,
        ENHY_SKEL_WOMAN_3,
        { 255, 255, 255, 255 },
        ENHY_SKEL_WOMAN_3,
        { 255, 255, 255, 255 },
        ENHY_ANIM_22,
    },
    /* ENHY_TYPE_MAN_1_BEARD */
    {
        ENHY_HEAD_MAN_1_BEARD,
        ENHY_SKEL_MAN_1,
        { 255, 255, 255, 255 },
        ENHY_SKEL_MAN_1,
        { 255, 255, 255, 255 },
        ENHY_ANIM_1,
    },
    /* ENHY_TYPE_MAN_2_BALD */
    {
        ENHY_HEAD_MAN_2_BALD,
        ENHY_SKEL_MAN_2,
        { 255, 255, 255, 0 },
        ENHY_SKEL_MAN_2,
        { 55, 55, 255, 0 },
        ENHY_ANIM_15,
    },
    /* ENHY_TYPE_MAN_1_SHAVED_BLACK_SHIRT */
    {
        ENHY_HEAD_MAN_1_SHAVED,
        ENHY_SKEL_MAN_1,
        { 0, 0, 0, 0 },
        ENHY_SKEL_MAN_1,
        { 255, 0, 0, 0 },
        ENHY_ANIM_11,
    },
    /* ENHY_TYPE_BEGGAR */
    {
        ENHY_HEAD_MAN_2_LONG_HAIR,
        ENHY_SKEL_MAN_2,
        { 50, 80, 0, 0 },
        ENHY_SKEL_MAN_2,
        { 50, 80, 0, 0 },
        ENHY_ANIM_16,
    },
    /* ENHY_TYPE_OLD_WOMAN */
    {
        ENHY_HEAD_OLD_WOMAN,
        ENHY_SKEL_OLD_WOMAN,
        { 255, 255, 255, 255 },
        ENHY_SKEL_OLD_WOMAN,
        { 255, 255, 255, 255 },
        ENHY_ANIM_10,
    },
    /* ENHY_TYPE_OLD_MAN */
    {
        ENHY_HEAD_OLD_MAN,
        ENHY_SKEL_OLD_MAN,
        { 0, 50, 160, 0 },
        ENHY_SKEL_OLD_MAN,
        { 255, 255, 255, 0 },
        ENHY_ANIM_4,
    },
    /* ENHY_TYPE_YOUNG_WOMAN_BROWN_HAIR */
    {
        ENHY_HEAD_YOUNG_WOMAN_BROWN_HAIR,
        ENHY_SKEL_YOUNG_WOMAN,
        { 160, 180, 255, 0 },
        ENHY_SKEL_YOUNG_WOMAN,
        { 160, 180, 255, 0 },
        ENHY_ANIM_9,
    },
    /* ENHY_TYPE_MAN_2_MUSTACHE_RED_SHIRT */
    {
        ENHY_HEAD_MAN_2_MUSTACHE,
        ENHY_SKEL_MAN_2,
        { 220, 0, 80, 0 },
        ENHY_SKEL_MAN_2,
        { 255, 255, 255, 0 },
        ENHY_ANIM_13,
    },
    /* ENHY_TYPE_MAN_2_MUSTACHE_BLUE_SHIRT */
    {
        ENHY_HEAD_MAN_2_MUSTACHE,
        ENHY_SKEL_MAN_2,
        { 0, 130, 220, 0 },
        ENHY_SKEL_MAN_2,
        { 255, 255, 255, 0 },
        ENHY_ANIM_14,
    },
    /* ENHY_TYPE_YOUNG_WOMAN_ORANGE_HAIR */
    {
        ENHY_HEAD_YOUNG_WOMAN_ORANGE_HAIR,
        ENHY_SKEL_YOUNG_WOMAN,
        { 70, 160, 230, 0 },
        ENHY_SKEL_YOUNG_WOMAN,
        { 255, 255, 100, 0 },
        ENHY_ANIM_20,
    },
    /* ENHY_TYPE_MAN_2_ALT_MUSTACHE */
    {
        ENHY_HEAD_MAN_2_ALT_MUSTACHE,
        ENHY_SKEL_MAN_2,
        { 150, 60, 90, 0 },
        ENHY_SKEL_MAN_2,
        { 255, 240, 150, 0 },
        ENHY_ANIM_18,
    },
    /* ENHY_TYPE_MAN_1_BOWL_CUT_PURPLE_SHIRT */
    {
        ENHY_HEAD_MAN_1_BOWL_CUT,
        ENHY_SKEL_MAN_1,
        { 200, 180, 255, 0 },
        ENHY_SKEL_MAN_1,
        { 200, 180, 255, 0 },
        ENHY_ANIM_12,
    },
    /* ENHY_TYPE_MAN_2_BEARD */
    {
        ENHY_HEAD_MAN_2_BEARD,
        ENHY_SKEL_MAN_2,
        { 140, 255, 110, 0 },
        ENHY_SKEL_MAN_2,
        { 255, 255, 255, 0 },
        ENHY_ANIM_19,
    },
    /* ENHY_TYPE_OLD_MAN_BALD_BROWN_ROBE */
    {
        ENHY_HEAD_OLD_MAN_BALD,
        ENHY_SKEL_OLD_MAN,
        { 130, 70, 20, 0 },
        ENHY_SKEL_OLD_MAN,
        { 130, 180, 255, 0 },
        ENHY_ANIM_21,
    },
    /* ENHY_TYPE_MAN_2_MUSTACHE_WHITE_SHIRT */
    {
        ENHY_HEAD_MAN_2_MUSTACHE,
        ENHY_SKEL_MAN_2,
        { 255, 255, 255, 255 },
        ENHY_SKEL_MAN_2,
        { 255, 255, 255, 255 },
        ENHY_ANIM_5,
    },
    /* ENHY_TYPE_MAN_1_SHAVED_GREEN_SHIRT */
    {
        ENHY_HEAD_MAN_1_SHAVED,
        ENHY_SKEL_MAN_1,
        { 90, 100, 20, 255 },
        ENHY_SKEL_MAN_1,
        { 100, 140, 50, 255 },
        ENHY_ANIM_11,
    },
    /* ENHY_TYPE_WOMAN_2 */
    {
        ENHY_HEAD_WOMAN_2,
        ENHY_SKEL_WOMAN_2,
        { 255, 255, 255, 255 },
        ENHY_SKEL_WOMAN_2,
        { 255, 255, 255, 255 },
        ENHY_ANIM_6,
    },
    /* ENHY_TYPE_OLD_MAN_BALD_PURPLE_ROBE */
    {
        ENHY_HEAD_OLD_MAN_BALD,
        ENHY_SKEL_OLD_MAN,
        { 160, 0, 100, 0 },
        ENHY_SKEL_OLD_MAN,
        { 70, 130, 210, 0 },
        ENHY_ANIM_21,
    },
    /* ENHY_TYPE_MAN_1_BOWL_CUT_GREEN_SHIRT */
    {
        ENHY_HEAD_MAN_1_BOWL_CUT,
        ENHY_SKEL_MAN_1,
        { 160, 230, 0, 0 },
        ENHY_SKEL_MAN_1,
        { 0, 150, 110, 0 },
        ENHY_ANIM_12,
    },
};

typedef struct EnHyColliderInfo {
    /* 0x0 */ Vec3s offset;
    /* 0x6 */ s16 radius;
    /* 0x8 */ s16 height;
} EnHyColliderInfo; // size 0xA

static EnHyColliderInfo sColliderInfo[] = {
    /* ENHY_TYPE_DOG_LADY */ { { 0, 0, 4 }, 24, 70 },
    /* ENHY_TYPE_WOMAN_3 */ { { 0, 0, 8 }, 28, 62 },
    /* ENHY_TYPE_MAN_1_BEARD */ { { 0, 0, 4 }, 20, 60 },
    /* ENHY_TYPE_MAN_2_BALD */ { { 0, 0, 2 }, 20, 60 },
    /* ENHY_TYPE_MAN_1_SHAVED_BLACK_SHIRT */ { { 0, 0, -2 }, 20, 60 },
    /* ENHY_TYPE_BEGGAR */ { { 0, 0, 8 }, 24, 40 },
    /* ENHY_TYPE_OLD_WOMAN */ { { 0, 0, 10 }, 26, 40 },
    /* ENHY_TYPE_OLD_MAN */ { { 0, 0, 12 }, 26, 58 },
    /* ENHY_TYPE_YOUNG_WOMAN_BROWN_HAIR */ { { 0, 0, 2 }, 18, 68 },
    /* ENHY_TYPE_MAN_2_MUSTACHE_RED_SHIRT */ { { 0, 0, 4 }, 20, 60 },
    /* ENHY_TYPE_MAN_2_MUSTACHE_BLUE_SHIRT */ { { 0, 0, 4 }, 20, 60 },
    /* ENHY_TYPE_YOUNG_WOMAN_ORANGE_HAIR */ { { 0, 0, 6 }, 20, 64 },
    /* ENHY_TYPE_MAN_2_ALT_MUSTACHE */ { { 0, 0, 0 }, 18, 60 },
    /* ENHY_TYPE_MAN_1_BOWL_CUT_PURPLE_SHIRT */ { { 0, 0, 0 }, 16, 60 },
    /* ENHY_TYPE_MAN_2_BEARD */ { { 0, 0, 0 }, 16, 64 },
    /* ENHY_TYPE_OLD_MAN_BALD_BROWN_ROBE */ { { 0, 0, 8 }, 20, 58 },
    /* ENHY_TYPE_MAN_2_MUSTACHE_WHITE_SHIRT */ { { 4, 0, 0 }, 18, 62 },
    /* ENHY_TYPE_MAN_1_SHAVED_GREEN_SHIRT */ { { 4, 0, 0 }, 18, 62 },
    /* ENHY_TYPE_WOMAN_2 */ { { 0, 0, 8 }, 28, 62 },
    /* ENHY_TYPE_OLD_MAN_BALD_PURPLE_ROBE */ { { 0, 0, 0 }, 16, 60 },
    /* ENHY_TYPE_MAN_1_BOWL_CUT_GREEN_SHIRT */ { { 0, 0, 8 }, 20, 58 },
};

typedef struct EnHyPlayerTrackingInfo {
    /* 0x00 */ u8 presetIndex;
    /* 0x04 */ f32 childYOffset;
    /* 0x08 */ f32 adultYOffset;
} EnHyPlayerTrackingInfo; // size = 0xC

static EnHyPlayerTrackingInfo sPlayerTrackingInfo[] = {
    /* ENHY_TYPE_DOG_LADY */ { 6, 20.0f, 10.0f },
    /* ENHY_TYPE_WOMAN_3 */ { 6, 20.0f, 10.0f },
    /* ENHY_TYPE_MAN_1_BEARD */ { 7, 40.0f, 20.0f },
    /* ENHY_TYPE_MAN_2_BALD */ { 6, 20.0f, 10.0f },
    /* ENHY_TYPE_MAN_1_SHAVED_BLACK_SHIRT */ { 7, 40.0f, 20.0f },
    /* ENHY_TYPE_BEGGAR */ { 8, 0.0f, -20.0f },
    /* ENHY_TYPE_OLD_WOMAN */ { 9, 20.0f, 0.0f },
    /* ENHY_TYPE_OLD_MAN */ { 9, 20.0f, 0.0f },
    /* ENHY_TYPE_YOUNG_WOMAN_BROWN_HAIR */ { 6, 20.0f, 10.0f },
    /* ENHY_TYPE_MAN_2_MUSTACHE_RED_SHIRT */ { 6, 20.0f, 10.0f },
    /* ENHY_TYPE_MAN_2_MUSTACHE_BLUE_SHIRT */ { 6, 20.0f, 10.0f },
    /* ENHY_TYPE_YOUNG_WOMAN_ORANGE_HAIR */ { 6, 20.0f, 10.0f },
    /* ENHY_TYPE_MAN_2_ALT_MUSTACHE */ { 0, 0.0f, 0.0f },
    /* ENHY_TYPE_MAN_1_BOWL_CUT_PURPLE_SHIRT */ { 6, 20.0f, 10.0f },
    /* ENHY_TYPE_MAN_2_BEARD */ { 6, 20.0f, 10.0f },
    /* ENHY_TYPE_OLD_MAN_BALD_BROWN_ROBE */ { 10, 20.0f, 0.0f },
    /* ENHY_TYPE_MAN_2_MUSTACHE_WHITE_SHIRT */ { 6, 20.0f, 10.0f },
    /* ENHY_TYPE_MAN_1_SHAVED_GREEN_SHIRT */ { 6, 20.0f, 10.0f },
    /* ENHY_TYPE_WOMAN_2 */ { 6, 20.0f, 10.0f },
    /* ENHY_TYPE_OLD_MAN_BALD_PURPLE_ROBE */ { 6, 20.0f, 10.0f },
    /* ENHY_TYPE_MAN_1_BOWL_CUT_GREEN_SHIRT */ { 10, 20.0f, 0.0f },
};

typedef struct EnHyInit2Info {
    /* 0x00 */ f32 shadowScale;
    /* 0x04 */ Vec3f modelOffset;
    /* 0x10 */ f32 scale;
    /* 0x14 */ s8 attentionRangeType;
    /* 0x18 */ f32 interactRange;
} EnHyInit2Info; // size = 0x1C

static EnHyInit2Info sInit2Info[] = {
    /* ENHY_TYPE_DOG_LADY */ { 36.0f, { 0.0f, 0.0f, 600.0f }, 0.01f, 6, 30.0f },
    /* ENHY_TYPE_WOMAN_3 */ { 40.0f, { -100.0f, 0.0f, 400.0f }, 0.01f, 6, 30.0f },
    /* ENHY_TYPE_MAN_1_BEARD */ { 22.0f, { 0.0f, 0.0f, -200.0f }, 0.01f, 6, 30.0f },
    /* ENHY_TYPE_MAN_2_BALD */ { 20.0f, { -100.0f, 0.0f, 0.0f }, 0.01f, 6, 30.0f },
    /* ENHY_TYPE_MAN_1_SHAVED_BLACK_SHIRT */ { 22.0f, { 0.0f, 0.0f, 0.0f }, 0.01f, 6, 30.0f },
    /* ENHY_TYPE_BEGGAR */ { 21.0f, { 0.0f, 0.0f, 0.0f }, 0.01f, 6, 30.0f },
    /* ENHY_TYPE_OLD_WOMAN */ { 25.0f, { -100.0f, 0.0f, 600.0f }, 0.01f, 6, 30.0f },
    /* ENHY_TYPE_OLD_MAN */ { 28.0f, { -100.0f, 0.0f, 800.0f }, 0.01f, 6, 30.0f },
    /* ENHY_TYPE_YOUNG_WOMAN_BROWN_HAIR */ { 17.0f, { 0.0f, 0.0f, 700.0f }, 0.01f, 6, 30.0f },
    /* ENHY_TYPE_MAN_2_MUSTACHE_RED_SHIRT */ { 18.0f, { 0.0f, 0.0f, 100.0f }, 0.01f, 6, 30.0f },
