#include "z_boss_tw.h"
#include "objects/gameplay_keep/gameplay_keep.h"

#define FLAGS 0x00000035

#define THIS ((BossTw*)thisx)

typedef struct {
    /* 0x0000 */ u8 type;
    /* 0x0001 */ u8 frame;
    /* 0x0004 */ Vec3f pos;
    /* 0x0010 */ Vec3f curSpeed;
    /* 0x001C */ Vec3f accel;
    /* 0x0028 */ Color_RGB8 color;
    /* 0x002C */ s16 alpha;
    /* 0x002E */ s16 args;
    /* 0x0030 */ s16 unk_30;    
    /* 0x0034 */ f32 scale;
    /* 0x0038 */ f32 dist; // dist? 
    /* used as roll for all types except type = 7, which is used as yaw */
    /* 0x003C */ f32 roll; // roll
    /* 0x0040 */ f32 yaw; // yaw
    /* 0x0044 */ Actor* unk_44;
} BossTwEEffect;

typedef enum {
    TW_KOTAKE,
    TW_KOUME,
    TW_TWINROVA,
    TW_FIRE_BLAST = 0x64,
    TW_FIRE_BLAST_GROUND,
    TW_ICE_BLAST,
    TW_ICE_BLAST_GROUND
} TwinrovaType;

typedef enum { BEAM_STATE_CHARGING = -1, BEAM_STATE_SHOOTING, BEAM_STATE_REFLECTING } TwinrovaBeamState;

void BossTw_Init(Actor* thisx, GlobalContext* globalCtx);
void BossTw_Destroy(Actor* thisx, GlobalContext* globalCtx);
void BossTw_Update(Actor* thisx, GlobalContext* globalCtx);
void BossTw_Draw(Actor* thisx, GlobalContext* globalCtx);
void func_80949CE4(BossTw* this, GlobalContext* globalCtx, u8 arg2);
void func_8094A1C0(BossTw* this, GlobalContext* globalCtx);
void func_80948668(GlobalContext* globalCtx);
void func_8094A740(BossTw* this, GlobalContext* globalCtx);
void func_8094A398(BossTw* this, GlobalContext* globalCtx);
void func_8094A12C(BossTw* this, GlobalContext* globalCtx);
void func_8094A0C4(BossTw* this, GlobalContext* globalCtx);
