/*
 * File: z_fishing.c
 * Overlay: ovl_Fishing
 * Description: Fishing Pond man and Fish
 */

#include "z_fishing.h"

#include "overlays/actors/ovl_En_Kanban/z_en_kanban.h"
#include "vt.h"

#define FLAGS 0x00000010

#define THIS ((Fishing*)thisx)

void Fishing_Init(Actor* thisx, GlobalContext* globalCtx);
void Fishing_Destroy(Actor* thisx, GlobalContext* globalCtx);
void Fishing_Update(Actor* thisx, GlobalContext* globalCtx);
void func_80B7825C(Actor* thisx, GlobalContext* globalCtx);
void Fishing_Draw(Actor* thisx, GlobalContext* globalCtx);
void func_80B7A278(Actor* thisx, GlobalContext* globalCtx);

typedef struct {
    /* 0x00 */ u8 unk_00;
    /* 0x02 */ Vec3s unk_02;
} struct_80B7A8D8; // size = 0x08

typedef struct {
    /* 0x00 */ u8 unk_00;
    /* 0x02 */ Vec3s unk_02;
    /* 0x08 */ u8 unk_08;
    /* 0x0C */ f32 unk_0C;
} struct_80B7AD40; // size = 0x10

typedef struct {
    /* 0x00 */ Vec3f unk_00;
    /* 0x0C */ f32 unk_0C;
    /* 0x10 */ f32 unk_10;
    /* 0x14 */ f32 unk_14;
    /* 0x18 */ f32 unk_18;
    /* 0x1C */ f32 unk_1C;
    /* 0x20 */ f32 unk_20;
    /* 0x24 */ f32 unk_24;
    /* 0x28 */ s16 unk_28;
    /* 0x2C */ f32 unk_2C;
    /* 0x30 */ u8 unk_30;
    /* 0x32 */ s16 unk_32;
    /* 0x34 */ u8 unk_34;
    /* 0x38 */ f32 unk_38;
} struct_80B7FEF8; // size = 0x3C

typedef struct {
    /* 0x00 */ u8 unk_00;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ Vec3f unk_04;
    /* 0x10 */ Vec3f unk_10;
    /* 0x1C */ char unk_1C[0x10];
    /* 0x2C */ f32 unk_2C;
    /* 0x30 */ char unk_30[0x0C];
    /* 0x3C */ s16 unk_3C;
    /* 0x3E */ s16 unk_3E;
    /* 0x40 */ s16 unk_40;
    /* 0x42 */ char unk_42[0x02];
    /* 0x44 */ u8 unk_44;
    /* 0x45 */ char unk_45[0x03];
} struct_80B81FC8; // size = 0x48

typedef struct {
    /* 0x00 */ Vec3f unk_00;
    /* 0x0C */ Vec3f unk_0C;
    /* 0x18 */ Vec3f unk_18;
    /* 0x24 */ u8 unk_24;
    /* 0x25 */ u8 unk_25;
    /* 0x26 */ char unk_26[0x04];
    /* 0x2A */ s16 unk_2A;
    /* 0x2C */ s16 unk_2C;
    /* 0x2E */ s16 unk_2E;
    /* 0x30 */ f32 unk_30;
    /* 0x34 */ f32 unk_34;
    /* 0x38 */ f32 unk_38;
    /* 0x3C */ f32 unk_3C;
} struct_80B830B8; // size = 0x40

const ActorInit Fishing_InitVars = {
    ACTOR_FISHING,
    ACTORCAT_NPC,
    FLAGS,
    OBJECT_FISH,
    sizeof(Fishing),
    (ActorFunc)Fishing_Init,
    (ActorFunc)Fishing_Destroy,
    (ActorFunc)Fishing_Update,
    (ActorFunc)Fishing_Draw,
};

extern u8 D_80B7A674;
extern u16 D_80B7A678;
extern s16 D_80B7A684;
extern u8 D_80B7A688;
extern u8 D_80B7A68C;
extern u8 D_80B7A690;
extern s16 D_80B7A694;
extern ColliderJntSphInit D_80B7A888;
extern Vec3f D_80B7A89C;
extern Vec3f D_80B7A8B4;
extern Vec3f D_80B7A8C0;
extern Vec3f D_80B7A8CC;
extern Vec3f D_80B7A698;
extern u8 D_80B7A6A4;
extern f32 D_80B7A6A8;
extern f32 D_80B7A6AC;
extern f32 D_80B7A6B0;
extern f32 D_80B7A6B4;
extern f32 D_80B7A6B8;
extern f32 D_80B7A6BC;
extern f32 D_80B7A6C0;
extern s16 D_80B7A6C4;
extern s16 D_80B7A6C8;
extern u8 D_80B7A6D4;
extern struct_80B7A8D8 D_80B7A8D8[];
extern struct_80B7AD40 D_80B7AD40[];
extern InitChainEntry D_80B7AE50[];
