/*
 * File: z_boss_va.c
 * Overlay: ovl_Boss_Va
 * Description: Barinade
 */

#include "z_boss_va.h"
#include "overlays/actors/ovl_En_Boom/z_en_boom.h"

#define FLAGS 0x00000035

#define THIS ((BossVa*)thisx)
#define BODY ((BossVa*)this->actor.parent)
#define vaGorePulse offset.x
#define vaGorePulseRate offset.y
#define vaBariFlags timer2
#define vaBariUnused headRot
#define vaCamRotMod headRot.x
#define vaBodySpinRate headRot.y

// #define NON_MATCHING

#define PHASE_2 3
#define PHASE_3 9
#define PHASE_4 15
#define PHASE_DEATH 18

typedef struct BossVaParticle {
    /* 0x00 */ Vec3f pos;
    /* 0x0C */ Vec3f velocity;
    /* 0x18 */ Vec3f accel;
    /* 0x24 */ u8 type;
    /* 0x26 */ u16 timer;
    /* 0x28 */ s16 mode;
    /* 0x2A */ Vec3s rot;
    /* 0x30 */ s16 primColor[4];
    /* 0x38 */ s16 envColor[4];
    /* 0x40 */ f32 scale;
    /* 0x44 */ f32 scaleMod;
    /* 0x48 */ Vec3f offset;
    /* 0x54 */ struct BossVa* parent;
} BossVaParticle; // size = 0x58

typedef enum BossVaParticleType {
    VA_NONE,
    VA_LARGE_SPARK,
    VA_BLAST_SPARK,
    VA_SMALL_SPARK,
    VA_SPARK_BALL,
    VA_ZAP_CHARGE,
    VA_BLOOD,
    VA_TUMOR,
    VA_GORE
} BossVaParticleType;

typedef enum BossVaSparkMode {
    SPARK_TETHER = 1,
    SPARK_BARI,
    SPARK_BLAST,
    SPARK_UNUSED,
    SPARK_BODY,
    SPARK_LINK
} BossVaSparkMode;

typedef enum BossVaBloodMode { BLOOD_DROPLET, BLOOD_SPLATTER, BLOOD_SPOT } BossVaBloodMode;

typedef enum BossVaTumorMode { TUMOR_UNUSED, TUMOR_BODY, TUMOR_ARM } BossVaTumorMode;

typedef enum BossVaGoreMode { GORE_PERMANENT, GORE_FLOOR, GORE_FADING } BossVaGoreMode;

typedef enum BossVaCutscene {
    INTRO_UNUSED_START = -5,
    INTRO_START,
    INTRO_LOOK_DOOR,
    INTRO_CLOSE_DOOR,
    INTRO_DOOR_SHUT,
    INTRO_CRACKLE,
    INTRO_SPAWN_BARI,
    INTRO_LOOK_BARI,
    INTRO_REVERSE_CAMERA,
    INTRO_SUPPORT_CAMERA,
    INTRO_BODY_SOUND,
