.rdata
glabel D_80B52AF8
    .asciz "[31m描画前処理モードがおかしい!!!!!!!!!!!!!!!!!!!!!!!!!\n[m"
    .balign 4

.text
glabel func_80B52348
/* 039B8 80B52348 27BDFFD8 */  addiu   $sp, $sp, 0xFFD8           ## $sp = FFFFFFD8
/* 039BC 80B5234C 8FAE003C */  lw      $t6, 0x003C($sp)           
/* 039C0 80B52350 AFBF0024 */  sw      $ra, 0x0024($sp)           
/* 039C4 80B52354 8DC20264 */  lw      $v0, 0x0264($t6)           ## 00000264
/* 039C8 80B52358 04400009 */  bltz    $v0, .L80B52380            
/* 039CC 80B5235C 00000000 */  nop
/* 039D0 80B52360 1C400007 */  bgtz    $v0, .L80B52380            
/* 039D4 80B52364 00027880 */  sll     $t7, $v0,  2               
/* 039D8 80B52368 3C0380B5 */  lui     $v1, %hi(D_80B528D0)       ## $v1 = 80B50000
/* 039DC 80B5236C 006F1821 */  addu    $v1, $v1, $t7              
/* 039E0 80B52370 8C6328D0 */  lw      $v1, %lo(D_80B528D0)($v1)  
/* 039E4 80B52374 8FB80038 */  lw      $t8, 0x0038($sp)           
/* 039E8 80B52378 54600007 */  bnel    $v1, $zero, .L80B52398     
/* 039EC 80B5237C 8FB9003C */  lw      $t9, 0x003C($sp)           
.L80B52380:
/* 039F0 80B52380 3C0480B5 */  lui     $a0, %hi(D_80B52AF8)       ## $a0 = 80B50000
/* 039F4 80B52384 0C00084C */  jal     osSyncPrintf
              
/* 039F8 80B52388 24842AF8 */  addiu   $a0, $a0, %lo(D_80B52AF8)  ## $a0 = 80B52AF8
/* 039FC 80B5238C 10000007 */  beq     $zero, $zero, .L80B523AC   
/* 03A00 80B52390 00001025 */  or      $v0, $zero, $zero          ## $v0 = 00000000
/* 03A04 80B52394 8FB9003C */  lw      $t9, 0x003C($sp)           
.L80B52398:
/* 03A08 80B52398 8FA80040 */  lw      $t0, 0x0040($sp)           
/* 03A0C 80B5239C AFB80010 */  sw      $t8, 0x0010($sp)           
/* 03A10 80B523A0 AFB90014 */  sw      $t9, 0x0014($sp)           
/* 03A14 80B523A4 0060F809 */  jalr    $ra, $v1                   
/* 03A18 80B523A8 AFA80018 */  sw      $t0, 0x0018($sp)           
.L80B523AC:
/* 03A1C 80B523AC 8FBF0024 */  lw      $ra, 0x0024($sp)           
/* 03A20 80B523B0 27BD0028 */  addiu   $sp, $sp, 0x0028           ## $sp = 00000000
/* 03A24 80B523B4 03E00008 */  jr      $ra                        
/* 03A28 80B523B8 00000000 */  nop
