#ifndef Z_EN_XC_H
#define Z_EN_XC_H

#include "ultra64.h"
#include "actor.h"

struct EnXc;

typedef void (*EnXcActionFunc)(struct EnXc*, struct PlayState*);
typedef void (*EnXcDrawFunc)(struct Actor*, struct PlayState*);

typedef enum EnXcType {
    /* 0 */ SHEIK_TYPE_DO_NOTHING,
    /* 1 */ SHEIK_TYPE_DEMO_FIRST_ADULT,
    /* 2 */ SHEIK_TYPE_DEMO_TEACH_SONG_2,
    /* 3 */ SHEIK_TYPE_LAKE_HYLIA,
    /* 4 */ SHEIK_TYPE_TRANSFORM,
    /* 5 */ SHEIK_TYPE_NOCTURNE,
    /* 6 */ SHEIK_TYPE_MINUET,
    /* 7 */ SHEIK_TYPE_BOLERO,
    /* 8 */ SHEIK_TYPE_SERENADE,
    /* 9 */ SHEIK_TYPE_TEMPLE_OF_TIME
} EnXcType;

typedef enum EnXcDrawMode {
    /* 0 */ SHEIK_DRAW_NOTHING,
    /* 1 */ SHEIK_DRAW_DEFAULT,
    /* 2 */ SHEIK_DRAW_PULLING_OUT_HARP,
    /* 3 */ SHEIK_DRAW_HARP,
    /* 4 */ SHEIK_DRAW_TRIFORCE,
    /* 5 */ SHEIK_DRAW_LOOKING_DOWN
} EnXcDrawMode;

typedef enum EnXcAction {
    /* 00 */ SHEIK_ACTION_0_TEACH1_CHECK_DEMO_START,
    /* 01 */ SHEIK_ACTION_1_TEACH1_INVISIBLE,
    /* 02 */ SHEIK_ACTION_2_TEACH1_GRACEFUL_FALL,
    /* 03 */ SHEIK_ACTION_3_TEACH1_START_WALK,
    /* 04 */ SHEIK_ACTION_4_TEACH1_WALK_TO_PLAYER,
    /* 05 */ SHEIK_ACTION_5_TEACH1_STOP_WALK,
    /* 06 */ SHEIK_ACTION_6_TEACH1_WAIT_CUE_PULL_OUT_HARP,
    /* 07 */ SHEIK_ACTION_7_TEACH1_PULL_OUT_HARP,
    /* 08 */ SHEIK_ACTION_8_TEACH1_PLAY_HARP_MOVE_TO_READY,
    /* 09 */ SHEIK_ACTION_9_TEACH1_PLAY_HARP,
    /* 10 */ SHEIK_ACTION_10_TEACH1_PLAY_HARP_FREEZE,
    /* 11 */ SHEIK_ACTION_11_TEACH1_PLAY_HARP_RETURN_FROM_READY,
    /* 12 */ SHEIK_ACTION_12_TEACH1_PUT_AWAY_HARP,
    /* 13 */ SHEIK_ACTION_13_TEACH1_IDLE,
    /* 14 */ SHEIK_ACTION_14_TEACH1_START_WALK_BACK,
    /* 15 */ SHEIK_ACTION_15_TEACH1_WALK_BACK,
    /* 16 */ SHEIK_ACTION_16_TEACH1_STOP_WALK_BACK,
    /* 17 */ SHEIK_ACTION_17_TEACH1_THROW_NUT,
    /* 18 */ SHEIK_ACTION_18_TEACH1_VANISH,
    /* 19 */ SHEIK_ACTION_19_TEACH1_CLEANUP_EFF_FLAME,
    /* 20 */ SHEIK_ACTION_20_DEMO_START,
    /* 21 */ SHEIK_ACTION_21_INVISIBLE,
    /* 22 */ SHEIK_ACTION_22_IDLE,
    /* 23 */ SHEIK_ACTION_23_START_WALK_BACK,
    /* 24 */ SHEIK_ACTION_24,
    /* 25 */ SHEIK_ACTION_25,
    /* 26 */ SHEIK_ACTION_26,
    /* 27 */ SHEIK_ACTION_27,
    /* 28 */ SHEIK_ACTION_28,
    /* 29 */ SHEIK_ACTION_29_TEACH2_CHECK_DEMO_START,
    /* 30 */ SHEIK_ACTION_30_TEACH2_INVISIBLE,
    /* 31 */ SHEIK_ACTION_31_TEACH2_WAIT_CUE_PULL_OUT_HARP,
    /* 32 */ SHEIK_ACTION_32_TEACH2_PULL_OUT_HARP,
    /* 33 */ SHEIK_ACTION_33_TEACH2_PLAY_HARP_MOVE_TO_READY,
    /* 34 */ SHEIK_ACTION_34_TEACH2_PLAY_HARP,
    /* 35 */ SHEIK_ACTION_35_TEACH2_PLAY_HARP_FREEZE,
    /* 36 */ SHEIK_ACTION_36_TEACH2_PLAY_HARP_RETURN_FROM_READY,
    /* 37 */ SHEIK_ACTION_37_TEACH2_PUT_HARP_AWAY,
    /* 38 */ SHEIK_ACTION_38_TEACH2_IDLE,
    /* 39 */ SHEIK_ACTION_39_TEACH2_START_WALK_BACK,
    /* 40 */ SHEIK_ACTION_40_TEACH2_WALK_BACK,
    /* 41 */ SHEIK_ACTION_41_TEACH2_STOP_WALK_BACK,
    /* 42 */ SHEIK_ACTION_42_TEACH2_THROW_NUT,
    /* 43 */ SHEIK_ACTION_43_TEACH2_VANISH,
    /* 44 */ SHEIK_ACTION_44_TEACH2_CLEANUP_EFF_FLAME,
    /* 45 */ SHEIK_ACTION_45_LAKECS_DEMO_START,
    /* 46 */ SHEIK_ACTION_46_LAKECS_INVISIBLE,
    /* 47 */ SHEIK_ACTION_47_LAKECS_IDLE,
    /* 48 */ SHEIK_ACTION_48_LAKECS_START_WALK_BACK,
    /* 49 */ SHEIK_ACTION_49_LAKECS_WALK_BACK,
    /* 50 */ SHEIK_ACTION_50_LAKECS_KNEEL_ON_TREE,
    /* 51 */ SHEIK_ACTION_51_LAKECS_DIVE,
    /* 52 */ SHEIK_ACTION_52_LAKECS_CLEANUP_EFF_SPLASH,
    /* 53 */ SHEIK_ACTION_53_TRANSFORM_INVISIBLE,
    /* 54 */ SHEIK_ACTION_54_TRANSFORM_IDLE,
    /* 55 */ SHEIK_ACTION_55_TRANSFORM_SHOW_TRIFORCE_MARK,
    /* 56 */ SHEIK_ACTION_56_TRANSFORM_SHOW_TRIFORCE_MARK_IDLE,
    /* 57 */ SHEIK_ACTION_57_NOCTURNE_INIT,
    /* 58 */ SHEIK_ACTION_58_NOCTURNE_IDLE,
    /* 59 */ SHEIK_ACTION_59_NOCTURNE_DEFENSE_STANCE,
    /* 60 */ SHEIK_ACTION_60_NOCTURNE_CONTORT,
    /* 61 */ SHEIK_ACTION_61_NOCTURNE_FALL,
    /* 62 */ SHEIK_ACTION_62_NOCTURNE_PUSHUP_PRONE,
    /* 63 */ SHEIK_ACTION_63_NOCTURNE_GESTURE_STOP_LINK,
    /* 64 */ SHEIK_ACTION_64_NOCTURNE2_KNEEL,
    /* 65 */ SHEIK_ACTION_65_NOCTURNE2_WAIT_CUE_PULL_OUT_HARP,
    /* 66 */ SHEIK_ACTION_66_NOCTURNE2_PULL_OUT_HARP,
    /* 67 */ SHEIK_ACTION_67_NOCTURNE2_PLAY_HARP_MOVE_TO_READY,
    /* 68 */ SHEIK_ACTION_68_NOCTURNE2_PLAY_HARP,
    /* 69 */ SHEIK_ACTION_69_NOCTURNE2_PLAY_HARP_FREEZE,
    /* 70 */ SHEIK_ACTION_70_NOCTURNE2_PLAY_HARP_RETURN_FROM_READY,
    /* 71 */ SHEIK_ACTION_71_NOCTURNE2_PUT_AWAY_HARP,
    /* 72 */ SHEIK_ACTION_72_NOCTURNE2_IDLE,
    /* 73 */ SHEIK_ACTION_73_NOCTURNE2_START_WALK_BACK,
    /* 74 */ SHEIK_ACTION_74_NOCTURNE2_WALK_BACK,
    /* 75 */ SHEIK_ACTION_75_NOCTURNE2_STOP_WALK_BACK,
    /* 76 */ SHEIK_ACTION_76_NOCTURNE2_THROW_NUT,
    /* 77 */ SHEIK_ACTION_77_NOCTURNE2_VANISH,
    /* 78 */ SHEIK_ACTION_78_NOCTURNE2_CLEANUP_EFF_FLAME,
    /* 79 */ SHEIK_ACTION_79_TEMPLE_OF_TIME_BLOCK_PEDESTAL,
    /* 80 */ SHEIK_ACTION_80_TEMPLE_OF_TIME_BLOCK_PEDESTAL_TALKING
} EnXcAction;

typedef struct EnXc {
    /* 0x0000 */ Actor actor;
    /* 0x014C */ SkelAnime skelAnime;
    /* 0x0190 */ Vec3s jointTable[17];
    /* 0x01F6 */ Vec3s morphTable[17];
    /* 0x025C */ s16 eyeIdx;
    /* 0x025E */ s16 blinkTimer;
    /* 0x0260 */ s32 action;
    /* 0x0264 */ s32 drawMode;
    /* 0x0268 */ f32 timer;
    /* 0x026C */ s32 lastCueIdNocturneCs;
    /* 0x0270 */ s32 unk_270; // unused
    /* 0x0274 */ s32 triforceMarkAnimState;
    /* 0x0278 */ s32 triforcePrimColor[4];
    /* 0x0288 */ s32 triforceEnvColor[4];
    /* 0x0298 */ f32 triforceScale[3];
    /* 0x02A4 */ s16 triforceAngle;
    /* 0x02A8 */ s32 canPlayTriforceMarkSfx;
    /* 0x02AC */ s32 triggerOnceTriforceMarkSfx;
    /* 0x02B0 */ Vec3f handPos;
    /* 0x02BC */ s32 unk_2BC; // hand pos related
    /* 0x02C0 */ ColliderCylinder collider;
    /* 0x030C */ s32 enableTrackPlayer;
    /* 0x0310 */ Actor* flameActor;
    /* 0x0314 */ NpcInteractInfo interactInfo;
} EnXc; // size = 0x033C

#endif
