.rdata
glabel D_80135450
    .asciz "\x1b[31m"
    .balign 4

glabel D_80135458
    .asciz "EffectShieldParticle_ct():パーティクル数がオーバしてます。\n"
    # EUC-JP: パーティクル数がオーバしてます。 | The number of particles is over
    .balign 4

glabel D_80135494
    .asciz "\x1b[m"
    .balign 4

.late_rodata
glabel D_801354D0
    .float 65534

.text
glabel func_80023450
/* A9A5F0 80023450 27BDFFB8 */  addiu $sp, $sp, -0x48
/* A9A5F4 80023454 AFB3003C */  sw    $s3, 0x3c($sp)
/* A9A5F8 80023458 AFB20038 */  sw    $s2, 0x38($sp)
/* A9A5FC 8002345C AFB10034 */  sw    $s1, 0x34($sp)
/* A9A600 80023460 00808825 */  move  $s1, $a0
/* A9A604 80023464 00A09825 */  move  $s3, $a1
/* A9A608 80023468 AFBF0044 */  sw    $ra, 0x44($sp)
/* A9A60C 8002346C AFB40040 */  sw    $s4, 0x40($sp)
/* A9A610 80023470 AFB00030 */  sw    $s0, 0x30($sp)
/* A9A614 80023474 F7B80028 */  sdc1  $f24, 0x28($sp)
/* A9A618 80023478 F7B60020 */  sdc1  $f22, 0x20($sp)
/* A9A61C 8002347C F7B40018 */  sdc1  $f20, 0x18($sp)
/* A9A620 80023480 10800081 */  beqz  $a0, .L80023688
/* A9A624 80023484 00809025 */   move  $s2, $a0
/* A9A628 80023488 50A00080 */  beql  $a1, $zero, .L8002368C
/* A9A62C 8002348C 8FBF0044 */   lw    $ra, 0x44($sp)
/* A9A630 80023490 90AE0000 */  lbu   $t6, ($a1)
/* A9A634 80023494 31CF00FF */  andi  $t7, $t6, 0xff
/* A9A638 80023498 29E10011 */  slti  $at, $t7, 0x11
/* A9A63C 8002349C 1420000C */  bnez  $at, .L800234D0
/* A9A640 800234A0 A08E0180 */   sb    $t6, 0x180($a0)
/* A9A644 800234A4 3C048013 */  lui   $a0, %hi(D_80135450) # $a0, 0x8013
/* A9A648 800234A8 0C00084C */  jal   osSyncPrintf
/* A9A64C 800234AC 24845450 */   addiu $a0, %lo(D_80135450) # addiu $a0, $a0, 0x5450
/* A9A650 800234B0 3C048013 */  lui   $a0, %hi(D_80135458) # $a0, 0x8013
/* A9A654 800234B4 0C00084C */  jal   osSyncPrintf
/* A9A658 800234B8 24845458 */   addiu $a0, %lo(D_80135458) # addiu $a0, $a0, 0x5458
/* A9A65C 800234BC 3C048013 */  lui   $a0, %hi(D_80135494) # $a0, 0x8013
/* A9A660 800234C0 0C00084C */  jal   osSyncPrintf
/* A9A664 800234C4 24845494 */   addiu $a0, %lo(D_80135494) # addiu $a0, $a0, 0x5494
/* A9A668 800234C8 10000070 */  b     .L8002368C
/* A9A66C 800234CC 8FBF0044 */   lw    $ra, 0x44($sp)
.L800234D0:
/* A9A670 800234D0 8A790002 */  lwl   $t9, 2($s3)
/* A9A674 800234D4 9A790005 */  lwr   $t9, 5($s3)
/* A9A678 800234D8 24140018 */  li    $s4, 24
/* A9A67C 800234DC 02208025 */  move  $s0, $s1
/* A9A680 800234E0 AA390182 */  swl   $t9, 0x182($s1)
/* A9A684 800234E4 BA390185 */  swr   $t9, 0x185($s1)
/* A9A688 800234E8 96790006 */  lhu   $t9, 6($s3)
/* A9A68C 800234EC A6390186 */  sh    $t9, 0x186($s1)
/* A9A690 800234F0 8A690008 */  lwl   $t1, 8($s3)
/* A9A694 800234F4 9A69000B */  lwr   $t1, 0xb($s3)
/* A9A698 800234F8 AA290188 */  swl   $t1, 0x188($s1)
/* A9A69C 800234FC BA29018B */  swr   $t1, 0x18b($s1)
/* A9A6A0 80023500 8A6B000C */  lwl   $t3, 0xc($s3)
/* A9A6A4 80023504 9A6B000F */  lwr   $t3, 0xf($s3)
/* A9A6A8 80023508 AA2B018C */  swl   $t3, 0x18c($s1)
/* A9A6AC 8002350C BA2B018F */  swr   $t3, 0x18f($s1)
/* A9A6B0 80023510 8A6D0010 */  lwl   $t5, 0x10($s3)
/* A9A6B4 80023514 9A6D0013 */  lwr   $t5, 0x13($s3)
/* A9A6B8 80023518 922B0180 */  lbu   $t3, 0x180($s1)
/* A9A6BC 8002351C AA2D0190 */  swl   $t5, 0x190($s1)
/* A9A6C0 80023520 BA2D0193 */  swr   $t5, 0x193($s1)
/* A9A6C4 80023524 8A6F0014 */  lwl   $t7, 0x14($s3)
/* A9A6C8 80023528 9A6F0017 */  lwr   $t7, 0x17($s3)
/* A9A6CC 8002352C 01740019 */  multu $t3, $s4
/* A9A6D0 80023530 AA2F0194 */  swl   $t7, 0x194($s1)
/* A9A6D4 80023534 BA2F0197 */  swr   $t7, 0x197($s1)
/* A9A6D8 80023538 8A790018 */  lwl   $t9, 0x18($s3)
/* A9A6DC 8002353C 9A79001B */  lwr   $t9, 0x1b($s3)
/* A9A6E0 80023540 AA390198 */  swl   $t9, 0x198($s1)
/* A9A6E4 80023544 BA39019B */  swr   $t9, 0x19b($s1)
/* A9A6E8 80023548 8A69001C */  lwl   $t1, 0x1c($s3)
/* A9A6EC 8002354C 9A69001F */  lwr   $t1, 0x1f($s3)
/* A9A6F0 80023550 00006012 */  mflo  $t4
/* A9A6F4 80023554 022C6821 */  addu  $t5, $s1, $t4
/* A9A6F8 80023558 AA29019C */  swl   $t1, 0x19c($s1)
/* A9A6FC 8002355C BA29019F */  swr   $t1, 0x19f($s1)
/* A9A700 80023560 C6640020 */  lwc1  $f4, 0x20($s3)
/* A9A704 80023564 022D082B */  sltu  $at, $s1, $t5
/* A9A708 80023568 E62401A0 */  swc1  $f4, 0x1a0($s1)
/* A9A70C 8002356C C6660024 */  lwc1  $f6, 0x24($s3)
/* A9A710 80023570 E62601A8 */  swc1  $f6, 0x1a8($s1)
/* A9A714 80023574 C6680028 */  lwc1  $f8, 0x28($s3)
/* A9A718 80023578 E62801AC */  swc1  $f8, 0x1ac($s1)
/* A9A71C 8002357C 926A002C */  lbu   $t2, 0x2c($s3)
/* A9A720 80023580 A22001B1 */  sb    $zero, 0x1b1($s1)
/* A9A724 80023584 10200025 */  beqz  $at, .L8002361C
/* A9A728 80023588 A22A01B0 */   sb    $t2, 0x1b0($s1)
/* A9A72C 8002358C 3C013F00 */  li    $at, 0x3F000000 # 0.000000
/* A9A730 80023590 4481C000 */  mtc1  $at, $f24
/* A9A734 80023594 3C018013 */  lui   $at, %hi(D_801354D0)
/* A9A738 80023598 4480A000 */  mtc1  $zero, $f20
/* A9A73C 8002359C C43654D0 */  lwc1  $f22, %lo(D_801354D0)($at)
.L800235A0:
/* A9A740 800235A0 0C03F66B */  jal   Math_Rand_ZeroOne
/* A9A744 800235A4 00000000 */   nop   
/* A9A748 800235A8 C62A01A8 */  lwc1  $f10, 0x1a8($s1)
/* A9A74C 800235AC E6140008 */  swc1  $f20, 8($s0)
/* A9A750 800235B0 E614000C */  swc1  $f20, 0xc($s0)
/* A9A754 800235B4 46185082 */  mul.s $f2, $f10, $f24
/* A9A758 800235B8 E6140010 */  swc1  $f20, 0x10($s0)
/* A9A75C 800235BC 46020402 */  mul.s $f16, $f0, $f2
/* A9A760 800235C0 46028480 */  add.s $f18, $f16, $f2
/* A9A764 800235C4 E6120000 */  swc1  $f18, ($s0)
/* A9A768 800235C8 C6040000 */  lwc1  $f4, ($s0)
/* A9A76C 800235CC 0C03F66B */  jal   Math_Rand_ZeroOne
/* A9A770 800235D0 E6040004 */   swc1  $f4, 4($s0)
/* A9A774 800235D4 46160182 */  mul.s $f6, $f0, $f22
/* A9A778 800235D8 4600320D */  trunc.w.s $f8, $f6
/* A9A77C 800235DC 440F4000 */  mfc1  $t7, $f8
/* A9A780 800235E0 0C03F66B */  jal   Math_Rand_ZeroOne
/* A9A784 800235E4 A60F0014 */   sh    $t7, 0x14($s0)
/* A9A788 800235E8 46160282 */  mul.s $f10, $f0, $f22
/* A9A78C 800235EC 26100018 */  addiu $s0, $s0, 0x18
/* A9A790 800235F0 4600540D */  trunc.w.s $f16, $f10
/* A9A794 800235F4 44198000 */  mfc1  $t9, $f16
/* A9A798 800235F8 00000000 */  nop   
/* A9A79C 800235FC A619FFFE */  sh    $t9, -2($s0)
/* A9A7A0 80023600 92480180 */  lbu   $t0, 0x180($s2)
/* A9A7A4 80023604 01140019 */  multu $t0, $s4
/* A9A7A8 80023608 00004812 */  mflo  $t1
/* A9A7AC 8002360C 02495021 */  addu  $t2, $s2, $t1
/* A9A7B0 80023610 020A082B */  sltu  $at, $s0, $t2
/* A9A7B4 80023614 1420FFE2 */  bnez  $at, .L800235A0
/* A9A7B8 80023618 00000000 */   nop   
.L8002361C:
/* A9A7BC 8002361C 8E6B003C */  lw    $t3, 0x3c($s3)
/* A9A7C0 80023620 24010001 */  li    $at, 1
/* A9A7C4 80023624 15610017 */  bne   $t3, $at, .L80023684
/* A9A7C8 80023628 AE2B01C4 */   sw    $t3, 0x1c4($s1)
/* A9A7CC 8002362C A22001B2 */  sb    $zero, 0x1b2($s1)
/* A9A7D0 80023630 8A6E002E */  lwl   $t6, 0x2e($s3)
/* A9A7D4 80023634 9A6E0031 */  lwr   $t6, 0x31($s3)
/* A9A7D8 80023638 AA2E01B4 */  swl   $t6, 0x1b4($s1)
/* A9A7DC 8002363C BA2E01B7 */  swr   $t6, 0x1b7($s1)
/* A9A7E0 80023640 8A6D0032 */  lwl   $t5, 0x32($s3)
/* A9A7E4 80023644 9A6D0035 */  lwr   $t5, 0x35($s3)
/* A9A7E8 80023648 AA2D01B8 */  swl   $t5, 0x1b8($s1)
/* A9A7EC 8002364C BA2D01BB */  swr   $t5, 0x1bb($s1)
/* A9A7F0 80023650 8A6E0036 */  lwl   $t6, 0x36($s3)
/* A9A7F4 80023654 9A6E0039 */  lwr   $t6, 0x39($s3)
/* A9A7F8 80023658 AA2E01BC */  swl   $t6, 0x1bc($s1)
/* A9A7FC 8002365C 0C009AC0 */  jal   func_80026B00
/* A9A800 80023660 BA2E01BF */   swr   $t6, 0x1bf($s1)
/* A9A804 80023664 0C009AC0 */  jal   func_80026B00
/* A9A808 80023668 00408025 */   move  $s0, $v0
/* A9A80C 8002366C 02002025 */  move  $a0, $s0
/* A9A810 80023670 244507A8 */  addiu $a1, $v0, 0x7a8
/* A9A814 80023674 0C01E9D9 */  jal   Lights_Insert
/* A9A818 80023678 262601B2 */   addiu $a2, $s1, 0x1b2
/* A9A81C 8002367C 10000002 */  b     .L80023688
/* A9A820 80023680 AE2201C0 */   sw    $v0, 0x1c0($s1)
.L80023684:
/* A9A824 80023684 AE2001C0 */  sw    $zero, 0x1c0($s1)
.L80023688:
/* A9A828 80023688 8FBF0044 */  lw    $ra, 0x44($sp)
.L8002368C:
/* A9A82C 8002368C D7B40018 */  ldc1  $f20, 0x18($sp)
/* A9A830 80023690 D7B60020 */  ldc1  $f22, 0x20($sp)
/* A9A834 80023694 D7B80028 */  ldc1  $f24, 0x28($sp)
/* A9A838 80023698 8FB00030 */  lw    $s0, 0x30($sp)
/* A9A83C 8002369C 8FB10034 */  lw    $s1, 0x34($sp)
/* A9A840 800236A0 8FB20038 */  lw    $s2, 0x38($sp)
/* A9A844 800236A4 8FB3003C */  lw    $s3, 0x3c($sp)
/* A9A848 800236A8 8FB40040 */  lw    $s4, 0x40($sp)
/* A9A84C 800236AC 03E00008 */  jr    $ra
/* A9A850 800236B0 27BD0048 */   addiu $sp, $sp, 0x48

