/*
 * File: z_player.c
 * Overlay: ovl_player_actor
 * Description: Link
 */

#include <ultra64.h>
#include <global.h>

#include "overlays/actors/ovl_En_Boom/z_en_boom.h"
#include "overlays/actors/ovl_En_Box/z_en_box.h"
#include "overlays/actors/ovl_Bg_Heavy_Block/z_bg_heavy_block.h"

#define THIS ((Player*)thisx)

void func_8083399C(GlobalContext* globalCtx, Player* this, s8 actionParam);
s32 func_80834A2C(Player* this, GlobalContext* globalCtx);
s32 func_80834B5C(Player* this, GlobalContext* globalCtx);
s32 func_80834C74(Player* this, GlobalContext* globalCtx);
s32 func_808351D4(Player* this, GlobalContext* globalCtx);
s32 func_808353D8(Player* this, GlobalContext* globalCtx);
s32 func_80835588(Player* this, GlobalContext* globalCtx);
s32 func_808356E8(Player* this, GlobalContext* globalCtx);
s32 func_80835800(Player* this, GlobalContext* globalCtx);
s32 func_80835884(Player* this, GlobalContext* globalCtx);
s32 func_808358F0(Player* this, GlobalContext* globalCtx);
s32 func_808359FC(Player* this, GlobalContext* globalCtx);
s32 func_80835B60(Player* this, GlobalContext* globalCtx);
s32 func_80835C08(Player* this, GlobalContext* globalCtx);
void func_80835F44(GlobalContext* globalCtx, Player* this, s32 item);
void func_80839F90(Player* this, GlobalContext* globalCtx);
s32 func_8083C61C(GlobalContext* globalCtx, Player* this);
void func_80840450(Player* this, GlobalContext* globalCtx);
void func_808407CC(Player* this, GlobalContext* globalCtx);

void func_8084D610(Player* this, GlobalContext* globalCtx);
void func_8084D7C4(Player* this, GlobalContext* globalCtx);
void func_8084D84C(Player* this, GlobalContext* globalCtx);
void func_8084DAB4(Player* this, GlobalContext* globalCtx);
void func_8084DC48(Player* this, GlobalContext* globalCtx);
void func_8084E1EC(Player* this, GlobalContext* globalCtx);
void func_8084E30C(Player* this, GlobalContext* globalCtx);
void func_8084E368(Player* this, GlobalContext* globalCtx);
void func_8084E3C4(Player* this, GlobalContext* globalCtx);
void func_8084E604(Player* this, GlobalContext* globalCtx);
void func_8084E6D4(Player* this, GlobalContext* globalCtx);
void func_8084E9AC(Player* this, GlobalContext* globalCtx);
void func_8084EAC0(Player* this, GlobalContext* globalCtx);
void func_8084ECA4(Player* this, GlobalContext* globalCtx);
void func_8084EED8(Player* this, GlobalContext* globalCtx);
void func_8084EFC0(Player* this, GlobalContext* globalCtx);
void func_8084F104(Player* this, GlobalContext* globalCtx);
void func_8084F390(Player* this, GlobalContext* globalCtx);
void func_8084F608(Player* this, GlobalContext* globalCtx);
void func_8084F698(Player* this, GlobalContext* globalCtx);
void func_8084F710(Player* this, GlobalContext* globalCtx);
void func_8084F88C(Player* this, GlobalContext* globalCtx);
void func_8084F9A0(Player* this, GlobalContext* globalCtx);
void func_8084F9C0(Player* this, GlobalContext* globalCtx);
void func_8084FA54(Player* this, GlobalContext* globalCtx);
void func_8084FB10(Player* this, GlobalContext* globalCtx);
void func_8084FBF4(Player* this, GlobalContext* globalCtx);
s32 func_8084FCAC(Player* this, GlobalContext* globalCtx);
void func_8084FF7C(Player* this);
void func_8085002C(Player* this);
s32 func_80850224(Player* this, GlobalContext* globalCtx);
void func_808502D0(Player* this, GlobalContext* globalCtx);
void func_808505DC(Player* this, GlobalContext* globalCtx);
void func_8085063C(Player* this, GlobalContext* globalCtx);
void func_8085076C(Player* this, GlobalContext* globalCtx);
void func_808507F4(Player* this, GlobalContext* globalCtx);
void func_80850AEC(Player* this, GlobalContext* globalCtx);
void func_80850C68(Player* this, GlobalContext* globalCtx);
void func_80850E84(Player* this, GlobalContext* globalCtx);
void func_80852280(GlobalContext* globalCtx, Player* this, CsCmdActorAction* arg2);
void func_80852944(GlobalContext* globalCtx, Player* this, CsCmdActorAction* arg2);
void func_808529D0(GlobalContext* globalCtx, Player* this, CsCmdActorAction* arg2);
void func_80852E14(Player* this, GlobalContext* globalCtx);
s32 func_80852EC8(GlobalContext* globalCtx);
s32 func_80852EFC(GlobalContext* globalCtx);
s32 func_80852F38(GlobalContext* globalCtx, Player* this);
s32 func_80852FFC(GlobalContext* globalCtx, Actor* actor, s32 action);
void func_80853080(Player* this, GlobalContext* globalCtx);
s32 func_808530E0(GlobalContext* globalCtx, s32 damage);
void func_80853148(GlobalContext* globalCtx, Actor* actor);

typedef struct {
    /* 0x00 */ u8 itemId;
    /* 0x01 */ u8 field;
    /* 0x02 */ s8 gi;
    /* 0x03 */ u8 textId;
    /* 0x04 */ u16 objectId;
} GetItemEntry; // size = 0x06

typedef struct {
    /* 0x00 */ s16 id;
    /* 0x02 */ s16 params;
} BottleActorInfo; // size = 0x04

typedef struct {
    /* 0x00 */ u16 unk_00;
    /* 0x02 */ s16 unk_02;
} struct_80832924; // size = 0x04

typedef struct {
    /* 0x00 */ u8 item;
    /* 0x02 */ s16 actorId;
} struct_80854188; // size = 0x04

typedef struct {
    /* 0x00 */ LinkAnimetionEntry* anim;
    /* 0x04 */ u8 unk_04;
} struct_808540F4; // size = 0x08

typedef struct {
    /* 0x00 */ LinkAnimetionEntry* unk_00;
    /* 0x04 */ LinkAnimetionEntry* unk_04;
    /* 0x08 */ LinkAnimetionEntry* unk_08;
    /* 0x0C */ u8 unk_0C;
    /* 0x0D */ u8 unk_0D;
} struct_80854190; // size = 0x10

typedef struct {
    /* 0x00 */ Vec3f pos;
    /* 0x0C */ s16 yaw;
} struct_808382DC; // size = 0x10

typedef struct {
    /* 0x00 */ LinkAnimetionEntry* unk_00;
    /* 0x04 */ LinkAnimetionEntry* unk_04;
    /* 0x08 */ u8 unk_08;
    /* 0x09 */ u8 unk_09;
} struct_80854554; // size = 0x0C

typedef struct {
    /* 0x00 */ LinkAnimetionEntry* anim;
    /* 0x04 */ f32 unk_04;
    /* 0x04 */ f32 unk_08;
} struct_80854578; // size = 0x0C

typedef struct {
    /* 0x00 */ s8 unk_00;
    /* 0x01 */ u8 unk_01;
    /* 0x02 */ u8 unk_02;
    /* 0x03 */ u8 unk_03;
    /* 0x04 */ u16 unk_04;
} struct_80854600; // size = 0x06

typedef struct {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ u8 unk_02;
    /* 0x03 */ u8 unk_03;
    /* 0x04 */ u8 unk_04;
} struct_80854A04; // size = 0x06

typedef struct {
    /* 0x00 */ s8 type;
    /* 0x04 */ union {
        void (*func)(GlobalContext* globalCtx, Player* this, CsCmdActorAction* arg2);
        LinkAnimetionEntry* anim;
    };
} struct_80854B18; // size = 0x08

// .data
extern u8 D_80853410[];
extern AgeProperties D_80853428[];
extern u32 D_808535D0;
extern f32 D_808535D4;
extern s16 D_808535D8;
extern s16 D_808535DC;
extern s32 D_808535E0;
extern s32 D_808535E4;
extern f32 D_808535E8;
extern f32 D_808535EC;
extern u32 D_808535F0;
extern u32 D_808535F4;
extern s16 D_808535F8;
extern s16 D_808535FC;
extern f32 D_80853600;
extern s32 D_80853604;
extern s32 D_80853608;
extern s32 D_8085360C;
extern s16 D_80853610;
extern s32 D_80853614;
extern s32 D_80853618;
extern u16 D_8085361C[];
extern GetItemEntry D_80853624[];
extern LinkAnimetionEntry* D_80853914[];
extern LinkAnimetionEntry* D_8085392C[];
extern LinkAnimetionEntry* D_80853944[];
extern LinkAnimetionEntry* D_8085395C[];
extern LinkAnimetionEntry* D_80853974[];
