#ifndef _Z64ACTOR_H_
#define _Z64ACTOR_H_

#define ACTOR_DLF_MAX 471
#define ACTOR_NUMBER_MAX 200
#define INVISIBLE_ACTOR_MAX 20
#define AM_FIELD_SIZE 0x27A0

// From z64.h
struct Actor;
struct GlobalContext;

// From z64light.h
struct LightMapper;

typedef struct
{
    f32 x, y;
} Vec2f;

typedef struct
{
    f32 x, y, z;
} Vec3f;

typedef struct
{
    s16 x, y, z;
} Vec3s;

typedef struct
{
    s32 x, y, z;
} Vec3i;

typedef struct
{
    Vec3f pos;
    Vec3s rot;
} PosRot; // size = 0x14

typedef struct
{
    /* 0x00 */ char   unk_00[0x8];
    /* 0x08 */ Vec3s  norm;  // Normal vector
    /* 0x0E */ s16    dist;  // Plane distance from origin
} CollisionPoly; // size = 0x10

typedef void (*ActorFunc)(struct Actor*, struct GlobalContext*);

typedef struct
{
    /* 0x00 */ s16 id;
    /* 0x02 */ u8  type; // Classifies actor and determines when actor will execute
    /* 0x03 */ u8  room; // Room instance was spawned in. If value set to FF in rom, instance does not despawn when swapping rooms
    /* 0x04 */ u32 flags;
    /* 0x08 */ s16 objectId;
    /* 0x0C */ u32 instanceSize;
    /* 0x10 */ ActorFunc init; // Constructor
    /* 0x14 */ ActorFunc destroy; // Destructor
    /* 0x18 */ ActorFunc update; // Main Update Function
    /* 0x1C */ ActorFunc draw; // Draw function
} ActorInit; // size = 0x20

typedef enum
{
    ALLOCTYPE_NORMAL,
    ALLOCTYPE_ABSOLUTE,
    ALLOCTYPE_PERMANENT
} AllocType;

typedef struct
{
    /* 0x00 */ u32   vromStart;
    /* 0x04 */ u32   vromEnd;
    /* 0x08 */ void* vramStart;
    /* 0x0C */ void* vramEnd;
    /* 0x10 */ void* loadedRamAddr; // original name: "allocp"
    /* 0x14 */ ActorInit* initInfo;
    /* 0x18 */ char* name;
    /* 0x1C */ u16   allocType;
    /* 0x1E */ s8    nbLoaded; // original name: "clients"
} ActorOverlay; // size = 0x20

typedef struct
{
    struct
    {
        char damage : 4;
        char effect : 4;
    } attack[32];
} ActorDamageChart;

typedef struct
{
    /* 0x00 */ u8 health;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ s16 unk_04;
    /* 0x06 */ u8 mass;
} SubActor98Init;

typedef struct
{
    /* 0x00 */ ActorDamageChart* damageChart;  // For actors which contain a damage chart (example: Stalfos)...
    /* 0x04 */ Vec3f displacement; // Amount to correct velocity (0x5C) by when colliding into a body
    /* 0x10 */ s16   unk_10;
    /* 0x12 */ s16   unk_12;
    /* 0x14 */ u16   unk_14;
    /* 0x16 */ u8    mass; // Used to compute displacement, 50 is common value, 0xFF for infinite mass/unmoveable
    /* 0x17 */ u8    health;
    /* 0x18 */ u8    damage; // Amount to decrement health by
    /* 0x19 */ u8    damageEffect; // Stores what effect should occur when hit by a weapon
    /* 0x1A */ u8    impactEffect; // Maybe? set on deku nut when deku nut collides with gossip stone
    /* 0x1B */ u8    unk_1B;
} SubActorStruct98; // size = 0x1C

typedef struct
{
    /* 0x00 */ Vec3s  rot; // Current actor shape rotation
    /* 0x06 */ u8     unk_06;
    /* 0x08 */ f32    unk_08; // Model y axis offset. Represents model space units. collision mesh related
    /* 0x0C */ void (*shadowDrawFunc)(struct Actor*, struct LightMapper*, struct GlobalContext*);
    /* 0x10 */ f32    unk_10;
    /* 0x14 */ u8     unk_14;
    /* 0x15 */ u8     unk_15;
} ActorShape; // size = 0x18

typedef struct Actor
{
    /* 0x000 */ s16     id; // Actor Id
    /* 0x002 */ u8      type; // Actor Type. Refer to the corresponding enum for values
    /* 0x003 */ s8      room; // Room number the actor is part of. FF denotes that the actor won't despawn on a room change
    /* 0x004 */ u32     flags; // Flags used for various purposes
    /* 0x008 */ PosRot  initPosRot; // Contains Initial Rotation when Object is Spawned
    /* 0x01C */ s16     params; // original name: "args_data"; Configurable variable set by an actor's spawn data
    /* 0x01E */ s8      objBankIndex; // original name: "bank"; Object bank index of this actor's object dependency
    /* 0x01F */ s8      unk_1F;
    /* 0x020 */ u16     soundEffect; // Plays sound effect relative to actor's location (if within range of camera?)
    /* 0x022 */ u16     unk_22;
    /* 0x024 */ PosRot  posRot; // Current coordinates
    /* 0x038 */ PosRot  posRot2; // Related to camera
    /* 0x04C */ f32     unk_4C;
    /* 0x050 */ Vec3f   scale; // Sets x,y,z scaling factor. Typically, a factor of 0.01 is used for each axis
    /* 0x05C */ Vec3f   velocity;
    /* 0x068 */ f32     speedXZ; // Always positive, stores how fast the actor is traveling along the XZ plane
    /* 0x06C */ f32     gravity; // Acceleration due to gravity; value is added to Y velocity every frame
    /* 0x070 */ f32     minVelocityY; // Sets the lower bounds cap on velocity along the Y axis
    /* 0x074 */ CollisionPoly* wallPoly; // Wall polygon an actor is touching
    /* 0x078 */ CollisionPoly* floorPoly; // Floor polygon an actor is over/touching
    /* 0x07C */ u8      wallPolySource; // Complex Poly Surface Source. 0x32 = Scene
    /* 0x07D */ u8      floorPolySource; // Complex Poly Surface Source. 0x32 = Scene. related to 0x80/88
    /* 0x07E */ s16     unk_7E;
    /* 0x080 */ f32     unk_80; // Floor poly height?
    /* 0x084 */ f32     unk_84;
    /* 0x088 */ u16     bgCheckFlags;
    /* 0x08A */ s16     rotTowardsLinkY; // Rotation y (give item, possibly next facing dir?/face toward link?)
    /* 0x08C */ f32     waterSurfaceDist;
    /* 0x090 */ f32     xzDistanceFromLink;
    /* 0x094 */ f32     yDistanceFromLink;
    /* 0x098 */ SubActorStruct98 sub_98;
    /* 0x0B4 */ ActorShape shape;
    /* 0x0CC */ Vec3f   unk_CC; // Used in Link, not Deku Babas
    /* 0x0D8 */ Vec3f   unk_D8; // Used in Link, not Deku Babas
    /* 0x0E4 */ Vec3f   unk_E4; // Stores result of some vector transformation involving actor xyz vector, and a matrix at Global Context + 11D60
    /* 0x0F0 */ f32     unk_F0; // Related to above
    /* 0x0F4 */ f32     unk_F4;
    /* 0x0F8 */ f32     unk_F8;
    /* 0x0FC */ f32     unk_FC;
    /* 0x100 */ Vec3f   pos4; // Final Coordinates last frame (collision, NTSC 1.0 f 8002F8E0)
    /* 0x10C */ u8      unk_10C; // Z-Target related
    /* 0x10D */ u8      unk_10D; // Z-Target related
    /* 0x10E */ u16     textId; // Text id to pass to link/display when interacting with an actor (navi text, probably others)
    /* 0x110 */ u16     freeze; // Used for the "Redead Freeze" attack. Also used in func_80059EC8
    /* 0x112 */ u16     unk_112; // Damage color effect, first 12 bits controls color which can only be blue red and white, last 4 bits unknown, can't be 0
    /* 0x114 */ u8      unk_114; // Damage color effect timer, decremented toward 0 every frame
    /* 0x115 */ u8      activelyDrawn; // Indicates whether the actor is currently being drawn (but not through lens). 01 for yes, 00 for no
    /* 0x116 */ u8      unk_116; // Set within a routine that deals with collision
    /* 0x117 */ u8      naviEnemyId; // Sets what 0600 dialog to display when talking to navi. Default 0xFF

    /* 0x118 */ struct Actor* attachedA; // Interfacing Actor?
    // e.g. Link holding chu, Chu instance stores ptr to Link instance here;
    //      Anju having Link's ptr when giving an item
    //      Volvagia Hole stores Volvagia Flying here

    /* 0x11C */ struct Actor* attachedB; // Attached to Actor
    // e.g. Link holding chu, Link instance stores ptr to Bombchu instance here

    /* 0x120 */ struct Actor* prev; // Previous Actor of this type
    /* 0x124 */ struct Actor* next; // Next Actor of this type

    /* 0x128 */ ActorFunc init; // Initialization Routine. Mandatory
    /* 0x12C */ ActorFunc destroy; // Destruction Routine
    /* 0x130 */ ActorFunc update; // Main Update Routine, called every frame the actor is to be updated
    /* 0x134 */ ActorFunc draw; // Draw Routine, writes necessary display lists

    /* 0x138 */ ActorOverlay* overlayEntry; // Pointer to the overlay table entry for this actor
    /* 0x13C */ char    dbgPad[0x10]; // Padding that only exists in the debug rom
    /* From here on, the structure and size varies for each actor */
} Actor; // size = 0x14C

typedef enum
{
    COLTYPE_CYLINDER = 1,
    COLTYPE_CYLINDER_GROUP = 0,
    COLTYPE_QUAD = 3,
    COLTYPE_TRIANGLE_GROUP = 2
} ColliderType;

typedef struct
{
    /* 0x00 */ Actor* actor;
    /* 0x04 */ Actor* at;
    /* 0x08 */ Actor* ac;
    /* 0x0C */ Actor* ot;
    /* 0x10 */ u8 colliderFlags; /* Compared to 0x11 */
    /* 0x11 */ u8 collideFlags; /* Compared to 0x10 */
    /* 0x12 */ u8 maskA; /* Bitwise-and compared to 0x13 */
    /* 0x13 */ u8 maskB; /* Bitwise-and compared to 0x12 */
    /* 0x14 */ u8 unk_14;
    /* 0x15 */ u8 type; /* Cylinder Collection, Cylinder, Triangle Collection, Quad */
} Collider; // size = 0x18

typedef struct
{
    /* 0x00 */ s32 flags; /* Toucher Attack Identifier Flags */
    /* 0x04 */ u8 unk_04;
    /* 0x05 */ u8 damage; /* Damage or Stun Timer */
} ColliderTouch; // size = 0x08

typedef struct
{
    /* 0x00 */ s32 flags; /* Collision Exclusion Mask */
    /* 0x04 */ u8 effect; /* Damage Effect (Knockback, Fire, etc.) */
    /* 0x05 */ u8 unk_05;
    /* 0x06 */ s16 unk_06;
    /* 0x08 */ s16 unk_08;
    /* 0x0A */ s16 unk_0A;
} ColliderBump; // size = 0x0C

typedef struct ColliderBody
{
    /* 0x00 */ ColliderTouch toucher;
    /* 0x08 */ ColliderBump bumper;
    /* 0x14 */ u8 flags;
    /* 0x15 */ u8 toucherFlags;
    /* 0x16 */ u8 bumperFlags;
    /* 0x17 */ u8 flags2;
    /* 0x18 */ s32 unk_18;
    /* 0x1C */ struct ColliderBodyEntry* colBuf;
    /* 0x20 */ s32 unk_20;
    /* 0x24 */ struct ColliderBody* colliding;
} ColliderBody; // size = 0x28

typedef struct ColliderBodyEntry
{
    /* 0x00 */ ColliderBody c;
    /* 0x28 */ char unk_28[0x18];
} ColliderBodyEntry; // size = 0x40

typedef struct
{
    /* 0x00 */ u8 bodyFlags;
    /* 0x01 */ u8 unk_09[0x3]; /* 000000 */
    /* 0x04 */ s32 toucherMask; /* Attack Toucher Exclusion Mask */
    /* 0x08 */ u8 bumperEffect; /* Damage Effect (Knockback, Fire, etc.) */
    /* 0x09 */ u8 toucherDamage; /* Damage Amount or Stun Timer */
    /* 0x0A */ u8 unk_12[0x2]; /* 0000 */
    /* 0x0C */ s32 bumperMask; /* Bumper Exclusion Mask */
    /* 0x10 */ u8 unk_18[0x4]; /* 00000000 */
    /* 0x14 */ u8 toucherFlags; /* Attack Toucher Flags */
    /* 0x15 */ u8 bumperFlags; /* Bumper Flags */
    /* 0x16 */ u8 bodyFlags2;
    /* 0x17 */ u8 unk_1F; /* 00 */
} ColliderBodyInfoInner; // size = 0x1A

typedef struct
{
    /* 0x00 */ u8 unk_00;
    /* 0x01 */ u8 colliderFlags; /* Collider Flags */
    /* 0x02 */ u8 collideFlags; /* Collide Flags */
    /* 0x03 */ u8 maskA; /* Bitwise-And with Mask B */
    /* 0x04 */ u8 maskB; /* Bitwise-And with Mask A */
    /* 0x05 */ u8 type; /* Collider Type */
    /* 0x06 */ u8 unk_06[0x2]; /* 0000 */
} ColliderBodyInfo; // size = 0x08

typedef struct
{
    /* 0x00 */ s16 radius; /* Cylinder Radius */
    /* 0x02 */ s16 height; /* Cylinder Height */
    /* 0x04 */ s16 yShift; /* Shift Cylinder on Y Axis */
    /* 0x06 */ Vec3s position; /* {X, Y, Z} position of Cylinder */
} ColliderDimensions; // size = 0xC

typedef struct
{
    /* 0x00 */ Collider base;
    /* 0x18 */ ColliderBody body;
    /* 0x40 */ ColliderDimensions dim;
} ColliderCylinderMain; // size = 0x4C

typedef struct
{
    /* 0x00 */ ColliderBodyInfo body;
    /* 0x06 */ ColliderBodyInfoInner inner;
    /* 0x20 */ ColliderDimensions dim;
} ColliderCylinderInit; // size = 0x2C

typedef struct
{
    /* 0x00 */ Actor* actor;
    /* 0x04 */ char unk_04[0x10];
    /* 0x14 */ Vec3f scale1;
    /* 0x20 */ Vec3s rot1;
    /* 0x28 */ Vec3f pos1;
    /* 0x34 */ Vec3f scale2;
    /* 0x40 */ Vec3s rot2;
    /* 0x48 */ Vec3f pos2;
    /* 0x54 */ char unk_54[0x10];
} ActorMesh; // size = 0x64

typedef struct
{
    /* 0x000 */ Actor actor;
    /* 0x14C */ u32 dynaPolyId;
    /* 0x150 */ f32 unk_150;
    /* 0x154 */ f32 unk_154;
    /* 0x158 */ s16 unk_158;
    /* 0x15A */ u16 unk_15A;
    /* 0x15C */ u32 unk_15C;
    /* 0x160 */ u8 unk_160;
    /* 0x162 */ s16 unk_162;
} DynaPolyActor; // size = 0x164

typedef struct
{
    /* 0x0000 */ Actor   actor;
    /* 0x014C */ s8      currentTunic;
    /* 0x014D */ s8      currentSword;
    /* 0x014E */ s8      currentShield;
    /* 0x014F */ s8      currentBoots;
    /* 0x0150 */ s8      unk_150;
    /* 0x0151 */ s8      unk_151;
    /* 0x0152 */ s8      unk_152;
    /* 0x0153 */ s8      unk_153;
    /* 0x0154 */ s8      unk_154;
    /* 0x0155 */ char    unk_155[0x008];
    /* 0x015D */ u8      unk_15D;
    /* 0x015E */ u8      unk_15E;
    /* 0x015F */ u8      currentMask;
    /* 0x0160 */ char    unk_160[0x050];
    /* 0x01B0 */ u32     unk_1B0;
    /* 0x01B4 */ char    unk_1B4[0x1F8];
    /* 0x03AC */ Actor*  heldActor;
    /* 0x03B0 */ char    unk_3B0[0x084];
    /* 0x0434 */ u8      getItemId;
    /* 0x0436 */ u16     getItemDirection;
    /* 0x0438 */ Actor*  interactRangeActor;
    /* 0x043C */ s8      unk_43C;
    /* 0x0440 */ Actor*  rideActor;
    /* 0x0444 */ u8      action;
    /* 0x0445 */ char    unk_445[0x003];
    /* 0x0448 */ Actor*  unk_448;
    /* 0x0445 */ char    unk_44C[0x01E];
    /* 0x046A */ u16     unk_46A;
    /* 0x046C */ char    unk_46C[0x6E];
    /* 0x04DA */ s16     unk_4DA;
    /* 0x04DC */ char    unk_4DC[0x188];
    /* 0x0664 */ Actor*  unk_664;
    /* 0x0668 */ char    unk_668[0x004];
    /* 0x066C */ s32     unk_66C;
    /* 0x0670 */ char    unk_670[0x00C];
    /* 0x067C */ u32     stateFlags1;
    /* 0x0680 */ u32     stateFlags2;
    /* 0x0684 */ char    unk_684[0x008];
    /* 0x068C */ Actor*  unk_68C;
    /* 0x0690 */ char    unk_690[0x002];
    /* 0x0692 */ u8      unk_692;
    /* 0x0693 */ s8      exchangeItemId;
    /* 0x0694 */ Actor*  unk_694;
    /* 0x0698 */ f32     unk_698;
    /* 0x069C */ char    unk_69C[0x008];
    /* 0x06A4 */ f32     unk_6A4;
    /* 0x06A8 */ char    unk_6A8[0x5];
    /* 0x06AD */ u8      unk_6AD;
    /* 0x06AE */ char    unk_6AE[0x186];
    /* 0x0834 */ s16     unk_834;
    /* 0x0836 */ char    unk_836[0x006];
    /* 0x083C */ s16     unk_83C;
    /* 0x083E */ char    unk_83E[0x004];
    /* 0x0842 */ s8      swordAnimation;
    /* 0x0843 */ s8      swordState;
    /* 0x0844 */ u8      unk_844;
    /* 0x0845 */ u8      unk_845;
    /* 0x0846 */ u8      unk_846;
    /* 0x0847 */ char    unk_847[0x004];
    /* 0x084B */ s8      unk_84B[UNK_SIZE];
    /* 0x084C */ char    unk_84C[0x003];
    /* 0x084F */ s8      unk_84F;
    /* 0x0850 */ char    unk_850[0x050];
    /* 0x08A0 */ u8      unk_8A0;
    /* 0x08A1 */ u8      unk_8A1;
    /* 0x08A2 */ u16     unk_8A2;
    /* 0x08A4 */ f32     unk_8A4;
    /* 0x08A8 */ f32     unk_8A8;
    /* 0x08AC */ char    unk_8AC[0x174];
    /* 0x0A20 */ MtxF    mf_A20;
    /* 0x0A60 */ char    unk_A60[0x18];
    /* 0x0A78 */ s8      unk_A78;
    /* 0x0A79 */ char    unk_A79[0x1B];
} Player; //size = 0xA94

typedef enum
{
    /* 0x00 */ ACTORTYPE_SWITCH,
    /* 0x01 */ ACTORTYPE_BG,
    /* 0x02 */ ACTORTYPE_PLAYER,
    /* 0x03 */ ACTORTYPE_EXPLOSIVES,
    /* 0x04 */ ACTORTYPE_NPC,
    /* 0x05 */ ACTORTYPE_ENEMY,
    /* 0x06 */ ACTORTYPE_PROP,
    /* 0x07 */ ACTORTYPE_ITEMACTION,
    /* 0x08 */ ACTORTYPE_MISC,
    /* 0x09 */ ACTORTYPE_BOSS,
    /* 0x0A */ ACTORTYPE_DOOR,
    /* 0x0B */ ACTORTYPE_CHEST
} ActorType;

typedef enum
{
    /* 0x0000 */ ACTOR_PLAYER,
    /* 0x0001 */ ACTOR_UNSET_1,
    /* 0x0002 */ ACTOR_EN_TEST,
    /* 0x0003 */ ACTOR_UNSET_3,
    /* 0x0004 */ ACTOR_EN_GIRLA,
    /* 0x0005 */ ACTOR_UNSET_5,
    /* 0x0006 */ ACTOR_UNSET_6,
    /* 0x0007 */ ACTOR_EN_PART,
    /* 0x0008 */ ACTOR_EN_LIGHT,
    /* 0x0009 */ ACTOR_EN_DOOR,
    /* 0x000A */ ACTOR_EN_BOX, // Treasure Chest
    /* 0x000B */ ACTOR_BG_DY_YOSEIZO,
    /* 0x000C */ ACTOR_BG_HIDAN_FIREWALL,
    /* 0x000D */ ACTOR_EN_POH,
