.rdata
glabel D_8013ACB8
    .asciz "CollisionCheck_generalLineOcCheck():未対応 %dタイプ\n"
    # EUC-JP: 未対応 %dタイプ | %d's type is not supported
    .balign 4

.text
glabel func_80062530
/* AD96D0 80062530 27BDFFB8 */  addiu $sp, $sp, -0x48
/* AD96D4 80062534 AFBF0044 */  sw    $ra, 0x44($sp)
/* AD96D8 80062538 AFBE0040 */  sw    $fp, 0x40($sp)
/* AD96DC 8006253C AFB7003C */  sw    $s7, 0x3c($sp)
/* AD96E0 80062540 AFB60038 */  sw    $s6, 0x38($sp)
/* AD96E4 80062544 AFB50034 */  sw    $s5, 0x34($sp)
/* AD96E8 80062548 AFB40030 */  sw    $s4, 0x30($sp)
/* AD96EC 8006254C AFB3002C */  sw    $s3, 0x2c($sp)
/* AD96F0 80062550 AFB20028 */  sw    $s2, 0x28($sp)
/* AD96F4 80062554 AFB10024 */  sw    $s1, 0x24($sp)
/* AD96F8 80062558 AFB00020 */  sw    $s0, 0x20($sp)
/* AD96FC 8006255C 8CAE01C0 */  lw    $t6, 0x1c0($a1)
/* AD9700 80062560 24B101C4 */  addiu $s1, $a1, 0x1c4
/* AD9704 80062564 00A09025 */  move  $s2, $a1
/* AD9708 80062568 000E7880 */  sll   $t7, $t6, 2
/* AD970C 8006256C 00AFC021 */  addu  $t8, $a1, $t7
/* AD9710 80062570 271901C4 */  addiu $t9, $t8, 0x1c4
/* AD9714 80062574 0239082B */  sltu  $at, $s1, $t9
/* AD9718 80062578 0080B025 */  move  $s6, $a0
/* AD971C 8006257C 00C0B825 */  move  $s7, $a2
/* AD9720 80062580 00E0F025 */  move  $fp, $a3
/* AD9724 80062584 10200034 */  beqz  $at, .L80062658
/* AD9728 80062588 0000A025 */   move  $s4, $zero
/* AD972C 8006258C 8FB50058 */  lw    $s5, 0x58($sp)
/* AD9730 80062590 24130001 */  li    $s3, 1
/* AD9734 80062594 8FB0005C */  lw    $s0, 0x5c($sp)
.L80062598:
/* AD9738 80062598 0C0186FD */  jal   func_80061BF4
/* AD973C 8006259C 8E240000 */   lw    $a0, ($s1)
/* AD9740 800625A0 10530025 */  beq   $v0, $s3, .L80062638
/* AD9744 800625A4 00002825 */   move  $a1, $zero
/* AD9748 800625A8 1A00000C */  blez  $s0, .L800625DC
/* AD974C 800625AC 00001025 */   move  $v0, $zero
/* AD9750 800625B0 8E280000 */  lw    $t0, ($s1)
/* AD9754 800625B4 02A01825 */  move  $v1, $s5
/* AD9758 800625B8 8D040000 */  lw    $a0, ($t0)
.L800625BC:
/* AD975C 800625BC 8C690000 */  lw    $t1, ($v1)
/* AD9760 800625C0 24420001 */  addiu $v0, $v0, 1
/* AD9764 800625C4 14890003 */  bne   $a0, $t1, .L800625D4
/* AD9768 800625C8 00000000 */   nop   
/* AD976C 800625CC 10000003 */  b     .L800625DC
/* AD9770 800625D0 02602825 */   move  $a1, $s3
.L800625D4:
/* AD9774 800625D4 1450FFF9 */  bne   $v0, $s0, .L800625BC
/* AD9778 800625D8 24630004 */   addiu $v1, $v1, 4
.L800625DC:
/* AD977C 800625DC 50B30017 */  beql  $a1, $s3, .L8006263C
/* AD9780 800625E0 8E4B01C0 */   lw    $t3, 0x1c0($s2)
/* AD9784 800625E4 8E260000 */  lw    $a2, ($s1)
/* AD9788 800625E8 3C028012 */  lui   $v0, %hi(D_8011E018)
/* AD978C 800625EC 02C02025 */  move  $a0, $s6
/* AD9790 800625F0 90C30015 */  lbu   $v1, 0x15($a2)
/* AD9794 800625F4 02402825 */  move  $a1, $s2
/* AD9798 800625F8 02E03825 */  move  $a3, $s7
/* AD979C 800625FC 00035080 */  sll   $t2, $v1, 2
/* AD97A0 80062600 004A1021 */  addu  $v0, $v0, $t2
/* AD97A4 80062604 8C42E018 */  lw    $v0, %lo(D_8011E018)($v0)
/* AD97A8 80062608 14400007 */  bnez  $v0, .L80062628
/* AD97AC 8006260C 00000000 */   nop   
/* AD97B0 80062610 3C048014 */  lui   $a0, %hi(D_8013ACB8) # $a0, 0x8014
/* AD97B4 80062614 2484ACB8 */  addiu $a0, %lo(D_8013ACB8) # addiu $a0, $a0, -0x5348
/* AD97B8 80062618 0C00084C */  jal   osSyncPrintf
/* AD97BC 8006261C 00602825 */   move  $a1, $v1
/* AD97C0 80062620 10000006 */  b     .L8006263C
/* AD97C4 80062624 8E4B01C0 */   lw    $t3, 0x1c0($s2)
.L80062628:
/* AD97C8 80062628 0040F809 */  jalr  $v0
/* AD97CC 8006262C AFBE0010 */  sw    $fp, 0x10($sp)
/* AD97D0 80062630 14400009 */  bnez  $v0, .L80062658
/* AD97D4 80062634 0040A025 */   move  $s4, $v0
.L80062638:
/* AD97D8 80062638 8E4B01C0 */  lw    $t3, 0x1c0($s2)
.L8006263C:
/* AD97DC 8006263C 26310004 */  addiu $s1, $s1, 4
/* AD97E0 80062640 000B6080 */  sll   $t4, $t3, 2
/* AD97E4 80062644 024C6821 */  addu  $t5, $s2, $t4
/* AD97E8 80062648 25AE01C4 */  addiu $t6, $t5, 0x1c4
/* AD97EC 8006264C 022E082B */  sltu  $at, $s1, $t6
/* AD97F0 80062650 1420FFD1 */  bnez  $at, .L80062598
/* AD97F4 80062654 00000000 */   nop   
.L80062658:
/* AD97F8 80062658 8FBF0044 */  lw    $ra, 0x44($sp)
/* AD97FC 8006265C 02801025 */  move  $v0, $s4
/* AD9800 80062660 8FB40030 */  lw    $s4, 0x30($sp)
/* AD9804 80062664 8FB00020 */  lw    $s0, 0x20($sp)
/* AD9808 80062668 8FB10024 */  lw    $s1, 0x24($sp)
/* AD980C 8006266C 8FB20028 */  lw    $s2, 0x28($sp)
/* AD9810 80062670 8FB3002C */  lw    $s3, 0x2c($sp)
/* AD9814 80062674 8FB50034 */  lw    $s5, 0x34($sp)
/* AD9818 80062678 8FB60038 */  lw    $s6, 0x38($sp)
/* AD981C 8006267C 8FB7003C */  lw    $s7, 0x3c($sp)
/* AD9820 80062680 8FBE0040 */  lw    $fp, 0x40($sp)
/* AD9824 80062684 03E00008 */  jr    $ra
/* AD9828 80062688 27BD0048 */   addiu $sp, $sp, 0x48

/* AD982C 8006268C 27BDFFE0 */  addiu $sp, $sp, -0x20
/* AD9830 80062690 AFBF001C */  sw    $ra, 0x1c($sp)
/* AD9834 80062694 AFA00010 */  sw    $zero, 0x10($sp)
/* AD9838 80062698 0C01894C */  jal   func_80062530
/* AD983C 8006269C AFA00014 */   sw    $zero, 0x14($sp)
/* AD9840 800626A0 8FBF001C */  lw    $ra, 0x1c($sp)
/* AD9844 800626A4 27BD0020 */  addiu $sp, $sp, 0x20
/* AD9848 800626A8 03E00008 */  jr    $ra
/* AD984C 800626AC 00000000 */   nop   

